ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/*
 * Component description for TCC
 *
 * Copyright (c) 2022 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2019-11-25T06:52:33Z */
#ifndef _SAMD21_TCC_COMPONENT_H_
#define _SAMD21_TCC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TCC                                          */
/* ************************************************************************** */

/* -------- TCC_CTRLA : (TCC Offset: 0x00) (R/W 32) Control A -------- */
#define TCC_CTRLA_RESETVALUE _UINT32_(0x00) /*  (TCC_CTRLA) Control A  Reset Value */

#define TCC_CTRLA_SWRST_Pos _UINT32_(0) /* (TCC_CTRLA) Software Reset Position */
#define TCC_CTRLA_SWRST_Msk (_UINT32_(0x1) << TCC_CTRLA_SWRST_Pos) /* (TCC_CTRLA) Software Reset Mask */
#define TCC_CTRLA_SWRST(value)                                                                                         \
        (TCC_CTRLA_SWRST_Msk &                                                                                         \
         (_UINT32_(value) << TCC_CTRLA_SWRST_Pos)) /* Assigment of value for SWRST in the TCC_CTRLA register */
#define TCC_CTRLA_ENABLE_Pos _UINT32_(1) /* (TCC_CTRLA) Enable Position */
#define TCC_CTRLA_ENABLE_Msk (_UINT32_(0x1) << TCC_CTRLA_ENABLE_Pos) /* (TCC_CTRLA) Enable Mask */
#define TCC_CTRLA_ENABLE(value)                                                                                        \
        (TCC_CTRLA_ENABLE_Msk &                                                                                        \
         (_UINT32_(value) << TCC_CTRLA_ENABLE_Pos)) /* Assigment of value for ENABLE in the TCC_CTRLA register */
#define TCC_CTRLA_RESOLUTION_Pos _UINT32_(5) /* (TCC_CTRLA) Enhanced Resolution Position */
#define TCC_CTRLA_RESOLUTION_Msk (_UINT32_(0x3) << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Enhanced Resolution Mask   \
                                                                              */
#define TCC_CTRLA_RESOLUTION(value)                                                                                    \
        (TCC_CTRLA_RESOLUTION_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << TCC_CTRLA_RESOLUTION_Pos)) /* Assigment of value for RESOLUTION in the TCC_CTRLA register */
#define TCC_CTRLA_RESOLUTION_NONE_Val _UINT32_(0x0) /* (TCC_CTRLA) Dithering is disabled  */
#define TCC_CTRLA_RESOLUTION_DITH4_Val _UINT32_(0x1) /* (TCC_CTRLA) Dithering is done every 16 PWM frames  */
#define TCC_CTRLA_RESOLUTION_DITH5_Val _UINT32_(0x2) /* (TCC_CTRLA) Dithering is done every 32 PWM frames  */
#define TCC_CTRLA_RESOLUTION_DITH6_Val _UINT32_(0x3) /* (TCC_CTRLA) Dithering is done every 64 PWM frames  */
#define TCC_CTRLA_RESOLUTION_NONE                                                                                      \
        (TCC_CTRLA_RESOLUTION_NONE_Val << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is disabled Position  */
#define TCC_CTRLA_RESOLUTION_DITH4                                                                                     \
        (                                                                                                              \
                TCC_CTRLA_RESOLUTION_DITH4_Val                                                                         \
                << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 16 PWM frames Position  */
#define TCC_CTRLA_RESOLUTION_DITH5                                                                                     \
        (                                                                                                              \
                TCC_CTRLA_RESOLUTION_DITH5_Val                                                                         \
                << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 32 PWM frames Position  */
#define TCC_CTRLA_RESOLUTION_DITH6                                                                                     \
        (                                                                                                              \
                TCC_CTRLA_RESOLUTION_DITH6_Val                                                                         \
                << TCC_CTRLA_RESOLUTION_Pos) /* (TCC_CTRLA) Dithering is done every 64 PWM frames Position  */
#define TCC_CTRLA_PRESCALER_Pos _UINT32_(8) /* (TCC_CTRLA) Prescaler Position */
#define TCC_CTRLA_PRESCALER_Msk (_UINT32_(0x7) << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Prescaler Mask */
#define TCC_CTRLA_PRESCALER(value)                                                                                     \
        (TCC_CTRLA_PRESCALER_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_CTRLA_PRESCALER_Pos)) /* Assigment of value for PRESCALER in the TCC_CTRLA register */
#define TCC_CTRLA_PRESCALER_DIV1_Val _UINT32_(0x0) /* (TCC_CTRLA) No division  */
#define TCC_CTRLA_PRESCALER_DIV2_Val _UINT32_(0x1) /* (TCC_CTRLA) Divide by 2  */
#define TCC_CTRLA_PRESCALER_DIV4_Val _UINT32_(0x2) /* (TCC_CTRLA) Divide by 4  */
#define TCC_CTRLA_PRESCALER_DIV8_Val _UINT32_(0x3) /* (TCC_CTRLA) Divide by 8  */
#define TCC_CTRLA_PRESCALER_DIV16_Val _UINT32_(0x4) /* (TCC_CTRLA) Divide by 16  */
#define TCC_CTRLA_PRESCALER_DIV64_Val _UINT32_(0x5) /* (TCC_CTRLA) Divide by 64  */
#define TCC_CTRLA_PRESCALER_DIV256_Val _UINT32_(0x6) /* (TCC_CTRLA) Divide by 256  */
#define TCC_CTRLA_PRESCALER_DIV1024_Val _UINT32_(0x7) /* (TCC_CTRLA) Divide by 1024  */
#define TCC_CTRLA_PRESCALER_DIV1                                                                                       \
        (TCC_CTRLA_PRESCALER_DIV1_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) No division Position  */
#define TCC_CTRLA_PRESCALER_DIV2                                                                                       \
        (TCC_CTRLA_PRESCALER_DIV2_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 2 Position  */
#define TCC_CTRLA_PRESCALER_DIV4                                                                                       \
        (TCC_CTRLA_PRESCALER_DIV4_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 4 Position  */
#define TCC_CTRLA_PRESCALER_DIV8                                                                                       \
        (TCC_CTRLA_PRESCALER_DIV8_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 8 Position  */
#define TCC_CTRLA_PRESCALER_DIV16                                                                                      \
        (TCC_CTRLA_PRESCALER_DIV16_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 16 Position  */
#define TCC_CTRLA_PRESCALER_DIV64                                                                                      \
        (TCC_CTRLA_PRESCALER_DIV64_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 64 Position  */
#define TCC_CTRLA_PRESCALER_DIV256                                                                                     \
        (TCC_CTRLA_PRESCALER_DIV256_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 256 Position  */
#define TCC_CTRLA_PRESCALER_DIV1024                                                                                    \
        (TCC_CTRLA_PRESCALER_DIV1024_Val << TCC_CTRLA_PRESCALER_Pos) /* (TCC_CTRLA) Divide by 1024 Position  */
#define TCC_CTRLA_RUNSTDBY_Pos _UINT32_(11) /* (TCC_CTRLA) Run in Standby Position */
#define TCC_CTRLA_RUNSTDBY_Msk (_UINT32_(0x1) << TCC_CTRLA_RUNSTDBY_Pos) /* (TCC_CTRLA) Run in Standby Mask */
#define TCC_CTRLA_RUNSTDBY(value)                                                                                      \
        (TCC_CTRLA_RUNSTDBY_Msk &                                                                                      \
         (_UINT32_(value) << TCC_CTRLA_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the TCC_CTRLA register */
#define TCC_CTRLA_PRESCSYNC_Pos _UINT32_(12) /* (TCC_CTRLA) Prescaler and Counter Synchronization Selection Position   \
                                              */
#define TCC_CTRLA_PRESCSYNC_Msk                                                                                        \
        (_UINT32_(0x3)                                                                                                 \
         << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Prescaler and Counter Synchronization Selection Mask */
#define TCC_CTRLA_PRESCSYNC(value)                                                                                     \
        (TCC_CTRLA_PRESCSYNC_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_CTRLA_PRESCSYNC_Pos)) /* Assigment of value for PRESCSYNC in the TCC_CTRLA register */
#define TCC_CTRLA_PRESCSYNC_GCLK_Val _UINT32_(0x0) /* (TCC_CTRLA) Reload or reset counter on next GCLK  */
#define TCC_CTRLA_PRESCSYNC_PRESC_Val _UINT32_(0x1) /* (TCC_CTRLA) Reload or reset counter on next prescaler clock  */
#define TCC_CTRLA_PRESCSYNC_RESYNC_Val                                                                                 \
        _UINT32_(0x2) /* (TCC_CTRLA) Reload or reset counter on next GCLK and reset prescaler counter  */
#define TCC_CTRLA_PRESCSYNC_GCLK                                                                                       \
        (                                                                                                              \
                TCC_CTRLA_PRESCSYNC_GCLK_Val                                                                           \
                << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next GCLK Position  */
#define TCC_CTRLA_PRESCSYNC_PRESC                                                                                      \
        (                                                                                                              \
                TCC_CTRLA_PRESCSYNC_PRESC_Val                                                                          \
                << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next prescaler clock Position */
#define TCC_CTRLA_PRESCSYNC_RESYNC                                                                                     \
        (TCC_CTRLA_PRESCSYNC_RESYNC_Val << TCC_CTRLA_PRESCSYNC_Pos) /* (TCC_CTRLA) Reload or reset counter on next     \
                                                                       GCLK and reset prescaler counter Position  */
#define TCC_CTRLA_ALOCK_Pos _UINT32_(14) /* (TCC_CTRLA) Auto Lock Position */
#define TCC_CTRLA_ALOCK_Msk (_UINT32_(0x1) << TCC_CTRLA_ALOCK_Pos) /* (TCC_CTRLA) Auto Lock Mask */
#define TCC_CTRLA_ALOCK(value)                                                                                         \
        (TCC_CTRLA_ALOCK_Msk &                                                                                         \
         (_UINT32_(value) << TCC_CTRLA_ALOCK_Pos)) /* Assigment of value for ALOCK in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN0_Pos _UINT32_(24) /* (TCC_CTRLA) Capture Channel 0 Enable Position */
#define TCC_CTRLA_CPTEN0_Msk (_UINT32_(0x1) << TCC_CTRLA_CPTEN0_Pos) /* (TCC_CTRLA) Capture Channel 0 Enable Mask */
#define TCC_CTRLA_CPTEN0(value)                                                                                        \
        (TCC_CTRLA_CPTEN0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_CTRLA_CPTEN0_Pos)) /* Assigment of value for CPTEN0 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN1_Pos _UINT32_(25) /* (TCC_CTRLA) Capture Channel 1 Enable Position */
#define TCC_CTRLA_CPTEN1_Msk (_UINT32_(0x1) << TCC_CTRLA_CPTEN1_Pos) /* (TCC_CTRLA) Capture Channel 1 Enable Mask */
#define TCC_CTRLA_CPTEN1(value)                                                                                        \
        (TCC_CTRLA_CPTEN1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_CTRLA_CPTEN1_Pos)) /* Assigment of value for CPTEN1 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN2_Pos _UINT32_(26) /* (TCC_CTRLA) Capture Channel 2 Enable Position */
#define TCC_CTRLA_CPTEN2_Msk (_UINT32_(0x1) << TCC_CTRLA_CPTEN2_Pos) /* (TCC_CTRLA) Capture Channel 2 Enable Mask */
#define TCC_CTRLA_CPTEN2(value)                                                                                        \
        (TCC_CTRLA_CPTEN2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_CTRLA_CPTEN2_Pos)) /* Assigment of value for CPTEN2 in the TCC_CTRLA register */
#define TCC_CTRLA_CPTEN3_Pos _UINT32_(27) /* (TCC_CTRLA) Capture Channel 3 Enable Position */
#define TCC_CTRLA_CPTEN3_Msk (_UINT32_(0x1) << TCC_CTRLA_CPTEN3_Pos) /* (TCC_CTRLA) Capture Channel 3 Enable Mask */
#define TCC_CTRLA_CPTEN3(value)                                                                                        \
        (TCC_CTRLA_CPTEN3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_CTRLA_CPTEN3_Pos)) /* Assigment of value for CPTEN3 in the TCC_CTRLA register */
#define TCC_CTRLA_Msk _UINT32_(0x0F007F63) /* (TCC_CTRLA) Register Mask  */

#define TCC_CTRLA_CPTEN_Pos _UINT32_(24) /* (TCC_CTRLA Position) Capture Channel 3 Enable */
#define TCC_CTRLA_CPTEN_Msk (_UINT32_(0xF) << TCC_CTRLA_CPTEN_Pos) /* (TCC_CTRLA Mask) CPTEN */
#define TCC_CTRLA_CPTEN(value) (TCC_CTRLA_CPTEN_Msk & (_UINT32_(value) << TCC_CTRLA_CPTEN_Pos))

