ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/* -------- TCC_CTRLBCLR : (TCC Offset: 0x04) (R/W 8) Control B Clear -------- */
#define TCC_CTRLBCLR_RESETVALUE _UINT8_(0x00) /*  (TCC_CTRLBCLR) Control B Clear  Reset Value */

#define TCC_CTRLBCLR_DIR_Pos _UINT8_(0) /* (TCC_CTRLBCLR) Counter Direction Position */
#define TCC_CTRLBCLR_DIR_Msk (_UINT8_(0x1) << TCC_CTRLBCLR_DIR_Pos) /* (TCC_CTRLBCLR) Counter Direction Mask */
#define TCC_CTRLBCLR_DIR(value)                                                                                        \
        (TCC_CTRLBCLR_DIR_Msk &                                                                                        \
         (_UINT8_(value) << TCC_CTRLBCLR_DIR_Pos)) /* Assigment of value for DIR in the TCC_CTRLBCLR register */
#define TCC_CTRLBCLR_LUPD_Pos _UINT8_(1) /* (TCC_CTRLBCLR) Lock Update Position */
#define TCC_CTRLBCLR_LUPD_Msk (_UINT8_(0x1) << TCC_CTRLBCLR_LUPD_Pos) /* (TCC_CTRLBCLR) Lock Update Mask */
#define TCC_CTRLBCLR_LUPD(value)                                                                                       \
        (TCC_CTRLBCLR_LUPD_Msk &                                                                                       \
         (_UINT8_(value) << TCC_CTRLBCLR_LUPD_Pos)) /* Assigment of value for LUPD in the TCC_CTRLBCLR register */
#define TCC_CTRLBCLR_ONESHOT_Pos _UINT8_(2) /* (TCC_CTRLBCLR) One-Shot Position */
#define TCC_CTRLBCLR_ONESHOT_Msk (_UINT8_(0x1) << TCC_CTRLBCLR_ONESHOT_Pos) /* (TCC_CTRLBCLR) One-Shot Mask */
#define TCC_CTRLBCLR_ONESHOT(value)                                                                                    \
        (TCC_CTRLBCLR_ONESHOT_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << TCC_CTRLBCLR_ONESHOT_Pos)) /* Assigment of value for ONESHOT in the TCC_CTRLBCLR register */
#define TCC_CTRLBCLR_IDXCMD_Pos _UINT8_(3) /* (TCC_CTRLBCLR) Ramp Index Command Position */
#define TCC_CTRLBCLR_IDXCMD_Msk (_UINT8_(0x3) << TCC_CTRLBCLR_IDXCMD_Pos) /* (TCC_CTRLBCLR) Ramp Index Command Mask */
#define TCC_CTRLBCLR_IDXCMD(value)                                                                                     \
        (TCC_CTRLBCLR_IDXCMD_Msk &                                                                                     \
         (_UINT8_(value) << TCC_CTRLBCLR_IDXCMD_Pos)) /* Assigment of value for IDXCMD in the TCC_CTRLBCLR register */
#define TCC_CTRLBCLR_IDXCMD_DISABLE_Val                                                                                \
        _UINT8_(0x0) /* (TCC_CTRLBCLR) Command disabled: Index toggles between cycles A and B  */
#define TCC_CTRLBCLR_IDXCMD_SET_Val                                                                                    \
        _UINT8_(0x1) /* (TCC_CTRLBCLR) Set index: cycle B will be forced in the next cycle  */
#define TCC_CTRLBCLR_IDXCMD_CLEAR_Val                                                                                  \
        _UINT8_(0x2) /* (TCC_CTRLBCLR) Clear index: cycle A will be forced in the next cycle  */
#define TCC_CTRLBCLR_IDXCMD_HOLD_Val                                                                                   \
        _UINT8_(0x3) /* (TCC_CTRLBCLR) Hold index: the next cycle will be the same as the current cycle  */
#define TCC_CTRLBCLR_IDXCMD_DISABLE                                                                                    \
        (TCC_CTRLBCLR_IDXCMD_DISABLE_Val << TCC_CTRLBCLR_IDXCMD_Pos) /* (TCC_CTRLBCLR) Command disabled: Index toggles \
                                                                        between cycles A and B Position  */
#define TCC_CTRLBCLR_IDXCMD_SET                                                                                        \
        (TCC_CTRLBCLR_IDXCMD_SET_Val                                                                                   \
         << TCC_CTRLBCLR_IDXCMD_Pos) /* (TCC_CTRLBCLR) Set index: cycle B will be forced in the next cycle Position */
#define TCC_CTRLBCLR_IDXCMD_CLEAR                                                                                      \
        (TCC_CTRLBCLR_IDXCMD_CLEAR_Val << TCC_CTRLBCLR_IDXCMD_Pos) /* (TCC_CTRLBCLR) Clear index: cycle A will be      \
                                                                      forced in the next cycle Position  */
#define TCC_CTRLBCLR_IDXCMD_HOLD                                                                                       \
        (TCC_CTRLBCLR_IDXCMD_HOLD_Val << TCC_CTRLBCLR_IDXCMD_Pos) /* (TCC_CTRLBCLR) Hold index: the next cycle will be \
                                                                     the same as the current cycle Position  */
#define TCC_CTRLBCLR_CMD_Pos _UINT8_(5) /* (TCC_CTRLBCLR) TCC Command Position */
#define TCC_CTRLBCLR_CMD_Msk (_UINT8_(0x7) << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) TCC Command Mask */
#define TCC_CTRLBCLR_CMD(value)                                                                                        \
        (TCC_CTRLBCLR_CMD_Msk &                                                                                        \
         (_UINT8_(value) << TCC_CTRLBCLR_CMD_Pos)) /* Assigment of value for CMD in the TCC_CTRLBCLR register */
#define TCC_CTRLBCLR_CMD_NONE_Val _UINT8_(0x0) /* (TCC_CTRLBCLR) No action  */
#define TCC_CTRLBCLR_CMD_RETRIGGER_Val _UINT8_(0x1) /* (TCC_CTRLBCLR) Clear start, restart or retrigger  */
#define TCC_CTRLBCLR_CMD_STOP_Val _UINT8_(0x2) /* (TCC_CTRLBCLR) Force stop  */
#define TCC_CTRLBCLR_CMD_UPDATE_Val _UINT8_(0x3) /* (TCC_CTRLBCLR) Force update of double buffered registers  */
#define TCC_CTRLBCLR_CMD_READSYNC_Val _UINT8_(0x4) /* (TCC_CTRLBCLR) Force COUNT read synchronization  */
#define TCC_CTRLBCLR_CMD_NONE                                                                                          \
        (TCC_CTRLBCLR_CMD_NONE_Val << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) No action Position  */
#define TCC_CTRLBCLR_CMD_RETRIGGER                                                                                     \
        (                                                                                                              \
                TCC_CTRLBCLR_CMD_RETRIGGER_Val                                                                         \
                << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) Clear start, restart or retrigger Position  */
#define TCC_CTRLBCLR_CMD_STOP                                                                                          \
        (TCC_CTRLBCLR_CMD_STOP_Val << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) Force stop Position  */
#define TCC_CTRLBCLR_CMD_UPDATE                                                                                        \
        (                                                                                                              \
                TCC_CTRLBCLR_CMD_UPDATE_Val                                                                            \
                << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) Force update of double buffered registers Position  */
#define TCC_CTRLBCLR_CMD_READSYNC                                                                                      \
        (                                                                                                              \
                TCC_CTRLBCLR_CMD_READSYNC_Val                                                                          \
                << TCC_CTRLBCLR_CMD_Pos) /* (TCC_CTRLBCLR) Force COUNT read synchronization Position  */
#define TCC_CTRLBCLR_Msk _UINT8_(0xFF) /* (TCC_CTRLBCLR) Register Mask  */


/* -------- TCC_CTRLBSET : (TCC Offset: 0x05) (R/W 8) Control B Set -------- */
#define TCC_CTRLBSET_RESETVALUE _UINT8_(0x00) /*  (TCC_CTRLBSET) Control B Set  Reset Value */

#define TCC_CTRLBSET_DIR_Pos _UINT8_(0) /* (TCC_CTRLBSET) Counter Direction Position */
#define TCC_CTRLBSET_DIR_Msk (_UINT8_(0x1) << TCC_CTRLBSET_DIR_Pos) /* (TCC_CTRLBSET) Counter Direction Mask */
#define TCC_CTRLBSET_DIR(value)                                                                                        \
        (TCC_CTRLBSET_DIR_Msk &                                                                                        \
         (_UINT8_(value) << TCC_CTRLBSET_DIR_Pos)) /* Assigment of value for DIR in the TCC_CTRLBSET register */
#define TCC_CTRLBSET_LUPD_Pos _UINT8_(1) /* (TCC_CTRLBSET) Lock Update Position */
#define TCC_CTRLBSET_LUPD_Msk (_UINT8_(0x1) << TCC_CTRLBSET_LUPD_Pos) /* (TCC_CTRLBSET) Lock Update Mask */
#define TCC_CTRLBSET_LUPD(value)                                                                                       \
        (TCC_CTRLBSET_LUPD_Msk &                                                                                       \
         (_UINT8_(value) << TCC_CTRLBSET_LUPD_Pos)) /* Assigment of value for LUPD in the TCC_CTRLBSET register */
#define TCC_CTRLBSET_ONESHOT_Pos _UINT8_(2) /* (TCC_CTRLBSET) One-Shot Position */
#define TCC_CTRLBSET_ONESHOT_Msk (_UINT8_(0x1) << TCC_CTRLBSET_ONESHOT_Pos) /* (TCC_CTRLBSET) One-Shot Mask */
#define TCC_CTRLBSET_ONESHOT(value)                                                                                    \
        (TCC_CTRLBSET_ONESHOT_Msk &                                                                                    \
         (_UINT8_(value)                                                                                               \
          << TCC_CTRLBSET_ONESHOT_Pos)) /* Assigment of value for ONESHOT in the TCC_CTRLBSET register */
#define TCC_CTRLBSET_IDXCMD_Pos _UINT8_(3) /* (TCC_CTRLBSET) Ramp Index Command Position */
#define TCC_CTRLBSET_IDXCMD_Msk (_UINT8_(0x3) << TCC_CTRLBSET_IDXCMD_Pos) /* (TCC_CTRLBSET) Ramp Index Command Mask */
#define TCC_CTRLBSET_IDXCMD(value)                                                                                     \
        (TCC_CTRLBSET_IDXCMD_Msk &                                                                                     \
         (_UINT8_(value) << TCC_CTRLBSET_IDXCMD_Pos)) /* Assigment of value for IDXCMD in the TCC_CTRLBSET register */
#define TCC_CTRLBSET_IDXCMD_DISABLE_Val                                                                                \
        _UINT8_(0x0) /* (TCC_CTRLBSET) Command disabled: Index toggles between cycles A and B  */
#define TCC_CTRLBSET_IDXCMD_SET_Val                                                                                    \
        _UINT8_(0x1) /* (TCC_CTRLBSET) Set index: cycle B will be forced in the next cycle  */
#define TCC_CTRLBSET_IDXCMD_CLEAR_Val                                                                                  \
        _UINT8_(0x2) /* (TCC_CTRLBSET) Clear index: cycle A will be forced in the next cycle  */
#define TCC_CTRLBSET_IDXCMD_HOLD_Val                                                                                   \
        _UINT8_(0x3) /* (TCC_CTRLBSET) Hold index: the next cycle will be the same as the current cycle  */
#define TCC_CTRLBSET_IDXCMD_DISABLE                                                                                    \
        (TCC_CTRLBSET_IDXCMD_DISABLE_Val << TCC_CTRLBSET_IDXCMD_Pos) /* (TCC_CTRLBSET) Command disabled: Index toggles \
                                                                        between cycles A and B Position  */
#define TCC_CTRLBSET_IDXCMD_SET                                                                                        \
        (TCC_CTRLBSET_IDXCMD_SET_Val                                                                                   \
         << TCC_CTRLBSET_IDXCMD_Pos) /* (TCC_CTRLBSET) Set index: cycle B will be forced in the next cycle Position */
#define TCC_CTRLBSET_IDXCMD_CLEAR                                                                                      \
        (TCC_CTRLBSET_IDXCMD_CLEAR_Val << TCC_CTRLBSET_IDXCMD_Pos) /* (TCC_CTRLBSET) Clear index: cycle A will be      \
                                                                      forced in the next cycle Position  */
#define TCC_CTRLBSET_IDXCMD_HOLD                                                                                       \
        (TCC_CTRLBSET_IDXCMD_HOLD_Val << TCC_CTRLBSET_IDXCMD_Pos) /* (TCC_CTRLBSET) Hold index: the next cycle will be \
                                                                     the same as the current cycle Position  */
#define TCC_CTRLBSET_CMD_Pos _UINT8_(5) /* (TCC_CTRLBSET) TCC Command Position */
#define TCC_CTRLBSET_CMD_Msk (_UINT8_(0x7) << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) TCC Command Mask */
#define TCC_CTRLBSET_CMD(value)                                                                                        \
        (TCC_CTRLBSET_CMD_Msk &                                                                                        \
         (_UINT8_(value) << TCC_CTRLBSET_CMD_Pos)) /* Assigment of value for CMD in the TCC_CTRLBSET register */
#define TCC_CTRLBSET_CMD_NONE_Val _UINT8_(0x0) /* (TCC_CTRLBSET) No action  */
#define TCC_CTRLBSET_CMD_RETRIGGER_Val _UINT8_(0x1) /* (TCC_CTRLBSET) Clear start, restart or retrigger  */
#define TCC_CTRLBSET_CMD_STOP_Val _UINT8_(0x2) /* (TCC_CTRLBSET) Force stop  */
#define TCC_CTRLBSET_CMD_UPDATE_Val _UINT8_(0x3) /* (TCC_CTRLBSET) Force update of double buffered registers  */
#define TCC_CTRLBSET_CMD_READSYNC_Val _UINT8_(0x4) /* (TCC_CTRLBSET) Force COUNT read synchronization  */
#define TCC_CTRLBSET_CMD_NONE                                                                                          \
        (TCC_CTRLBSET_CMD_NONE_Val << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) No action Position  */
#define TCC_CTRLBSET_CMD_RETRIGGER                                                                                     \
        (                                                                                                              \
                TCC_CTRLBSET_CMD_RETRIGGER_Val                                                                         \
                << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) Clear start, restart or retrigger Position  */
#define TCC_CTRLBSET_CMD_STOP                                                                                          \
        (TCC_CTRLBSET_CMD_STOP_Val << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) Force stop Position  */
#define TCC_CTRLBSET_CMD_UPDATE                                                                                        \
        (                                                                                                              \
                TCC_CTRLBSET_CMD_UPDATE_Val                                                                            \
                << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) Force update of double buffered registers Position  */
#define TCC_CTRLBSET_CMD_READSYNC                                                                                      \
        (                                                                                                              \
                TCC_CTRLBSET_CMD_READSYNC_Val                                                                          \
                << TCC_CTRLBSET_CMD_Pos) /* (TCC_CTRLBSET) Force COUNT read synchronization Position  */
#define TCC_CTRLBSET_Msk _UINT8_(0xFF) /* (TCC_CTRLBSET) Register Mask  */


