ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/* -------- TCC_SYNCBUSY : (TCC Offset: 0x08) ( R/ 32) Synchronization Busy -------- */
#define TCC_SYNCBUSY_RESETVALUE _UINT32_(0x00) /*  (TCC_SYNCBUSY) Synchronization Busy  Reset Value */

#define TCC_SYNCBUSY_SWRST_Pos _UINT32_(0) /* (TCC_SYNCBUSY) Swrst Busy Position */
#define TCC_SYNCBUSY_SWRST_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_SWRST_Pos) /* (TCC_SYNCBUSY) Swrst Busy Mask */
#define TCC_SYNCBUSY_SWRST(value)                                                                                      \
        (TCC_SYNCBUSY_SWRST_Msk &                                                                                      \
         (_UINT32_(value) << TCC_SYNCBUSY_SWRST_Pos)) /* Assigment of value for SWRST in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_ENABLE_Pos _UINT32_(1) /* (TCC_SYNCBUSY) Enable Busy Position */
#define TCC_SYNCBUSY_ENABLE_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_ENABLE_Pos) /* (TCC_SYNCBUSY) Enable Busy Mask */
#define TCC_SYNCBUSY_ENABLE(value)                                                                                     \
        (TCC_SYNCBUSY_ENABLE_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_SYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CTRLB_Pos _UINT32_(2) /* (TCC_SYNCBUSY) Ctrlb Busy Position */
#define TCC_SYNCBUSY_CTRLB_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_CTRLB_Pos) /* (TCC_SYNCBUSY) Ctrlb Busy Mask */
#define TCC_SYNCBUSY_CTRLB(value)                                                                                      \
        (TCC_SYNCBUSY_CTRLB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_SYNCBUSY_CTRLB_Pos)) /* Assigment of value for CTRLB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_STATUS_Pos _UINT32_(3) /* (TCC_SYNCBUSY) Status Busy Position */
#define TCC_SYNCBUSY_STATUS_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_STATUS_Pos) /* (TCC_SYNCBUSY) Status Busy Mask */
#define TCC_SYNCBUSY_STATUS(value)                                                                                     \
        (TCC_SYNCBUSY_STATUS_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_SYNCBUSY_STATUS_Pos)) /* Assigment of value for STATUS in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_COUNT_Pos _UINT32_(4) /* (TCC_SYNCBUSY) Count Busy Position */
#define TCC_SYNCBUSY_COUNT_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_COUNT_Pos) /* (TCC_SYNCBUSY) Count Busy Mask */
#define TCC_SYNCBUSY_COUNT(value)                                                                                      \
        (TCC_SYNCBUSY_COUNT_Msk &                                                                                      \
         (_UINT32_(value) << TCC_SYNCBUSY_COUNT_Pos)) /* Assigment of value for COUNT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PATT_Pos _UINT32_(5) /* (TCC_SYNCBUSY) Pattern Busy Position */
#define TCC_SYNCBUSY_PATT_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_PATT_Pos) /* (TCC_SYNCBUSY) Pattern Busy Mask */
#define TCC_SYNCBUSY_PATT(value)                                                                                       \
        (TCC_SYNCBUSY_PATT_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_PATT_Pos)) /* Assigment of value for PATT in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_WAVE_Pos _UINT32_(6) /* (TCC_SYNCBUSY) Wave Busy Position */
#define TCC_SYNCBUSY_WAVE_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_WAVE_Pos) /* (TCC_SYNCBUSY) Wave Busy Mask */
#define TCC_SYNCBUSY_WAVE(value)                                                                                       \
        (TCC_SYNCBUSY_WAVE_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_WAVE_Pos)) /* Assigment of value for WAVE in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PER_Pos _UINT32_(7) /* (TCC_SYNCBUSY) Period busy Position */
#define TCC_SYNCBUSY_PER_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_PER_Pos) /* (TCC_SYNCBUSY) Period busy Mask */
#define TCC_SYNCBUSY_PER(value)                                                                                        \
        (TCC_SYNCBUSY_PER_Msk &                                                                                        \
         (_UINT32_(value) << TCC_SYNCBUSY_PER_Pos)) /* Assigment of value for PER in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC0_Pos _UINT32_(8) /* (TCC_SYNCBUSY) Compare Channel 0 Busy Position */
#define TCC_SYNCBUSY_CC0_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_CC0_Pos) /* (TCC_SYNCBUSY) Compare Channel 0 Busy Mask */
#define TCC_SYNCBUSY_CC0(value)                                                                                        \
        (TCC_SYNCBUSY_CC0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_SYNCBUSY_CC0_Pos)) /* Assigment of value for CC0 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC1_Pos _UINT32_(9) /* (TCC_SYNCBUSY) Compare Channel 1 Busy Position */
#define TCC_SYNCBUSY_CC1_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_CC1_Pos) /* (TCC_SYNCBUSY) Compare Channel 1 Busy Mask */
#define TCC_SYNCBUSY_CC1(value)                                                                                        \
        (TCC_SYNCBUSY_CC1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_SYNCBUSY_CC1_Pos)) /* Assigment of value for CC1 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC2_Pos _UINT32_(10) /* (TCC_SYNCBUSY) Compare Channel 2 Busy Position */
#define TCC_SYNCBUSY_CC2_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_CC2_Pos) /* (TCC_SYNCBUSY) Compare Channel 2 Busy Mask */
#define TCC_SYNCBUSY_CC2(value)                                                                                        \
        (TCC_SYNCBUSY_CC2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_SYNCBUSY_CC2_Pos)) /* Assigment of value for CC2 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CC3_Pos _UINT32_(11) /* (TCC_SYNCBUSY) Compare Channel 3 Busy Position */
#define TCC_SYNCBUSY_CC3_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_CC3_Pos) /* (TCC_SYNCBUSY) Compare Channel 3 Busy Mask */
#define TCC_SYNCBUSY_CC3(value)                                                                                        \
        (TCC_SYNCBUSY_CC3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_SYNCBUSY_CC3_Pos)) /* Assigment of value for CC3 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PATTB_Pos _UINT32_(16) /* (TCC_SYNCBUSY) Pattern Buffer Busy Position */
#define TCC_SYNCBUSY_PATTB_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_PATTB_Pos) /* (TCC_SYNCBUSY) Pattern Buffer Busy Mask */
#define TCC_SYNCBUSY_PATTB(value)                                                                                      \
        (TCC_SYNCBUSY_PATTB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_SYNCBUSY_PATTB_Pos)) /* Assigment of value for PATTB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_WAVEB_Pos _UINT32_(17) /* (TCC_SYNCBUSY) Wave Buffer Busy Position */
#define TCC_SYNCBUSY_WAVEB_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_WAVEB_Pos) /* (TCC_SYNCBUSY) Wave Buffer Busy Mask */
#define TCC_SYNCBUSY_WAVEB(value)                                                                                      \
        (TCC_SYNCBUSY_WAVEB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_SYNCBUSY_WAVEB_Pos)) /* Assigment of value for WAVEB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_PERB_Pos _UINT32_(18) /* (TCC_SYNCBUSY) Period Buffer Busy Position */
#define TCC_SYNCBUSY_PERB_Msk (_UINT32_(0x1) << TCC_SYNCBUSY_PERB_Pos) /* (TCC_SYNCBUSY) Period Buffer Busy Mask */
#define TCC_SYNCBUSY_PERB(value)                                                                                       \
        (TCC_SYNCBUSY_PERB_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_PERB_Pos)) /* Assigment of value for PERB in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CCB0_Pos _UINT32_(19) /* (TCC_SYNCBUSY) Compare Channel Buffer 0 Busy Position */
#define TCC_SYNCBUSY_CCB0_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_SYNCBUSY_CCB0_Pos) /* (TCC_SYNCBUSY) Compare Channel Buffer 0 Busy Mask */
#define TCC_SYNCBUSY_CCB0(value)                                                                                       \
        (TCC_SYNCBUSY_CCB0_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_CCB0_Pos)) /* Assigment of value for CCB0 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CCB1_Pos _UINT32_(20) /* (TCC_SYNCBUSY) Compare Channel Buffer 1 Busy Position */
#define TCC_SYNCBUSY_CCB1_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_SYNCBUSY_CCB1_Pos) /* (TCC_SYNCBUSY) Compare Channel Buffer 1 Busy Mask */
#define TCC_SYNCBUSY_CCB1(value)                                                                                       \
        (TCC_SYNCBUSY_CCB1_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_CCB1_Pos)) /* Assigment of value for CCB1 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CCB2_Pos _UINT32_(21) /* (TCC_SYNCBUSY) Compare Channel Buffer 2 Busy Position */
#define TCC_SYNCBUSY_CCB2_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_SYNCBUSY_CCB2_Pos) /* (TCC_SYNCBUSY) Compare Channel Buffer 2 Busy Mask */
#define TCC_SYNCBUSY_CCB2(value)                                                                                       \
        (TCC_SYNCBUSY_CCB2_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_CCB2_Pos)) /* Assigment of value for CCB2 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_CCB3_Pos _UINT32_(22) /* (TCC_SYNCBUSY) Compare Channel Buffer 3 Busy Position */
#define TCC_SYNCBUSY_CCB3_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_SYNCBUSY_CCB3_Pos) /* (TCC_SYNCBUSY) Compare Channel Buffer 3 Busy Mask */
#define TCC_SYNCBUSY_CCB3(value)                                                                                       \
        (TCC_SYNCBUSY_CCB3_Msk &                                                                                       \
         (_UINT32_(value) << TCC_SYNCBUSY_CCB3_Pos)) /* Assigment of value for CCB3 in the TCC_SYNCBUSY register */
#define TCC_SYNCBUSY_Msk _UINT32_(0x007F0FFF) /* (TCC_SYNCBUSY) Register Mask  */

#define TCC_SYNCBUSY_CC_Pos _UINT32_(8) /* (TCC_SYNCBUSY Position) Compare Channel x Busy */
#define TCC_SYNCBUSY_CC_Msk (_UINT32_(0xF) << TCC_SYNCBUSY_CC_Pos) /* (TCC_SYNCBUSY Mask) CC */
#define TCC_SYNCBUSY_CC(value) (TCC_SYNCBUSY_CC_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CC_Pos))
#define TCC_SYNCBUSY_CCB_Pos _UINT32_(19) /* (TCC_SYNCBUSY Position) Compare Channel Buffer 3 Busy */
#define TCC_SYNCBUSY_CCB_Msk (_UINT32_(0xF) << TCC_SYNCBUSY_CCB_Pos) /* (TCC_SYNCBUSY Mask) CCB */
#define TCC_SYNCBUSY_CCB(value) (TCC_SYNCBUSY_CCB_Msk & (_UINT32_(value) << TCC_SYNCBUSY_CCB_Pos))

/* -------- TCC_FCTRLA : (TCC Offset: 0x0C) (R/W 32) Recoverable Fault A Configuration -------- */
#define TCC_FCTRLA_RESETVALUE _UINT32_(0x00) /*  (TCC_FCTRLA) Recoverable Fault A Configuration  Reset Value */

