ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_FCTRLA_SRC_Pos _UINT32_(0) /* (TCC_FCTRLA) Fault A Source Position */
#define TCC_FCTRLA_SRC_Msk (_UINT32_(0x3) << TCC_FCTRLA_SRC_Pos) /* (TCC_FCTRLA) Fault A Source Mask */
#define TCC_FCTRLA_SRC(value)                                                                                          \
        (TCC_FCTRLA_SRC_Msk &                                                                                          \
         (_UINT32_(value) << TCC_FCTRLA_SRC_Pos)) /* Assigment of value for SRC in the TCC_FCTRLA register */
#define TCC_FCTRLA_SRC_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLA) Fault input disabled  */
#define TCC_FCTRLA_SRC_ENABLE_Val _UINT32_(0x1) /* (TCC_FCTRLA) MCEx (x=0,1) event input  */
#define TCC_FCTRLA_SRC_INVERT_Val _UINT32_(0x2) /* (TCC_FCTRLA) Inverted MCEx (x=0,1) event input  */
#define TCC_FCTRLA_SRC_ALTFAULT_Val                                                                                    \
        _UINT32_(0x3) /* (TCC_FCTRLA) Alternate fault (A or B) state at the end of the previous period  */
#define TCC_FCTRLA_SRC_DISABLE                                                                                         \
        (TCC_FCTRLA_SRC_DISABLE_Val << TCC_FCTRLA_SRC_Pos) /* (TCC_FCTRLA) Fault input disabled Position  */
#define TCC_FCTRLA_SRC_ENABLE                                                                                          \
        (TCC_FCTRLA_SRC_ENABLE_Val << TCC_FCTRLA_SRC_Pos) /* (TCC_FCTRLA) MCEx (x=0,1) event input Position  */
#define TCC_FCTRLA_SRC_INVERT                                                                                          \
        (TCC_FCTRLA_SRC_INVERT_Val << TCC_FCTRLA_SRC_Pos) /* (TCC_FCTRLA) Inverted MCEx (x=0,1) event input Position   \
                                                           */
#define TCC_FCTRLA_SRC_ALTFAULT                                                                                        \
        (TCC_FCTRLA_SRC_ALTFAULT_Val << TCC_FCTRLA_SRC_Pos) /* (TCC_FCTRLA) Alternate fault (A or B) state at the end  \
                                                               of the previous period Position  */
#define TCC_FCTRLA_KEEP_Pos _UINT32_(3) /* (TCC_FCTRLA) Fault A Keeper Position */
#define TCC_FCTRLA_KEEP_Msk (_UINT32_(0x1) << TCC_FCTRLA_KEEP_Pos) /* (TCC_FCTRLA) Fault A Keeper Mask */
#define TCC_FCTRLA_KEEP(value)                                                                                         \
        (TCC_FCTRLA_KEEP_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLA_KEEP_Pos)) /* Assigment of value for KEEP in the TCC_FCTRLA register */
#define TCC_FCTRLA_QUAL_Pos _UINT32_(4) /* (TCC_FCTRLA) Fault A Qualification Position */
#define TCC_FCTRLA_QUAL_Msk (_UINT32_(0x1) << TCC_FCTRLA_QUAL_Pos) /* (TCC_FCTRLA) Fault A Qualification Mask */
#define TCC_FCTRLA_QUAL(value)                                                                                         \
        (TCC_FCTRLA_QUAL_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLA_QUAL_Pos)) /* Assigment of value for QUAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_BLANK_Pos _UINT32_(5) /* (TCC_FCTRLA) Fault A Blanking Mode Position */
#define TCC_FCTRLA_BLANK_Msk (_UINT32_(0x3) << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) Fault A Blanking Mode Mask */
#define TCC_FCTRLA_BLANK(value)                                                                                        \
        (TCC_FCTRLA_BLANK_Msk &                                                                                        \
         (_UINT32_(value) << TCC_FCTRLA_BLANK_Pos)) /* Assigment of value for BLANK in the TCC_FCTRLA register */
#define TCC_FCTRLA_BLANK_NONE_Val _UINT32_(0x0) /* (TCC_FCTRLA) No blanking applied  */
#define TCC_FCTRLA_BLANK_RISE_Val                                                                                      \
        _UINT32_(0x1) /* (TCC_FCTRLA) Blanking applied from rising edge of the output waveform  */
#define TCC_FCTRLA_BLANK_FALL_Val                                                                                      \
        _UINT32_(0x2) /* (TCC_FCTRLA) Blanking applied from falling edge of the output waveform  */
#define TCC_FCTRLA_BLANK_BOTH_Val                                                                                      \
        _UINT32_(0x3) /* (TCC_FCTRLA) Blanking applied from each toggle of the output waveform  */
#define TCC_FCTRLA_BLANK_NONE                                                                                          \
        (TCC_FCTRLA_BLANK_NONE_Val << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) No blanking applied Position  */
#define TCC_FCTRLA_BLANK_RISE                                                                                          \
        (TCC_FCTRLA_BLANK_RISE_Val                                                                                     \
         << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) Blanking applied from rising edge of the output waveform Position */
#define TCC_FCTRLA_BLANK_FALL                                                                                          \
        (TCC_FCTRLA_BLANK_FALL_Val << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) Blanking applied from falling edge of the  \
                                                               output waveform Position  */
#define TCC_FCTRLA_BLANK_BOTH                                                                                          \
        (TCC_FCTRLA_BLANK_BOTH_Val                                                                                     \
         << TCC_FCTRLA_BLANK_Pos) /* (TCC_FCTRLA) Blanking applied from each toggle of the output waveform Position */
#define TCC_FCTRLA_RESTART_Pos _UINT32_(7) /* (TCC_FCTRLA) Fault A Restart Position */
#define TCC_FCTRLA_RESTART_Msk (_UINT32_(0x1) << TCC_FCTRLA_RESTART_Pos) /* (TCC_FCTRLA) Fault A Restart Mask */
#define TCC_FCTRLA_RESTART(value)                                                                                      \
        (TCC_FCTRLA_RESTART_Msk &                                                                                      \
         (_UINT32_(value) << TCC_FCTRLA_RESTART_Pos)) /* Assigment of value for RESTART in the TCC_FCTRLA register */
#define TCC_FCTRLA_HALT_Pos _UINT32_(8) /* (TCC_FCTRLA) Fault A Halt Mode Position */
#define TCC_FCTRLA_HALT_Msk (_UINT32_(0x3) << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Fault A Halt Mode Mask */
#define TCC_FCTRLA_HALT(value)                                                                                         \
        (TCC_FCTRLA_HALT_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLA_HALT_Pos)) /* Assigment of value for HALT in the TCC_FCTRLA register */
#define TCC_FCTRLA_HALT_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLA) Halt action disabled  */
#define TCC_FCTRLA_HALT_HW_Val _UINT32_(0x1) /* (TCC_FCTRLA) Hardware halt action  */
#define TCC_FCTRLA_HALT_SW_Val _UINT32_(0x2) /* (TCC_FCTRLA) Software halt action  */
#define TCC_FCTRLA_HALT_NR_Val _UINT32_(0x3) /* (TCC_FCTRLA) Non-recoverable fault  */
#define TCC_FCTRLA_HALT_DISABLE                                                                                        \
        (TCC_FCTRLA_HALT_DISABLE_Val << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Halt action disabled Position  */
#define TCC_FCTRLA_HALT_HW                                                                                             \
        (TCC_FCTRLA_HALT_HW_Val << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Hardware halt action Position  */
#define TCC_FCTRLA_HALT_SW                                                                                             \
        (TCC_FCTRLA_HALT_SW_Val << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Software halt action Position  */
#define TCC_FCTRLA_HALT_NR                                                                                             \
        (TCC_FCTRLA_HALT_NR_Val << TCC_FCTRLA_HALT_Pos) /* (TCC_FCTRLA) Non-recoverable fault Position  */
#define TCC_FCTRLA_CHSEL_Pos _UINT32_(10) /* (TCC_FCTRLA) Fault A Capture Channel Position */
#define TCC_FCTRLA_CHSEL_Msk (_UINT32_(0x3) << TCC_FCTRLA_CHSEL_Pos) /* (TCC_FCTRLA) Fault A Capture Channel Mask */
#define TCC_FCTRLA_CHSEL(value)                                                                                        \
        (TCC_FCTRLA_CHSEL_Msk &                                                                                        \
         (_UINT32_(value) << TCC_FCTRLA_CHSEL_Pos)) /* Assigment of value for CHSEL in the TCC_FCTRLA register */
#define TCC_FCTRLA_CHSEL_CC0_Val _UINT32_(0x0) /* (TCC_FCTRLA) Capture value stored in channel 0  */
#define TCC_FCTRLA_CHSEL_CC1_Val _UINT32_(0x1) /* (TCC_FCTRLA) Capture value stored in channel 1  */
#define TCC_FCTRLA_CHSEL_CC2_Val _UINT32_(0x2) /* (TCC_FCTRLA) Capture value stored in channel 2  */
#define TCC_FCTRLA_CHSEL_CC3_Val _UINT32_(0x3) /* (TCC_FCTRLA) Capture value stored in channel 3  */
#define TCC_FCTRLA_CHSEL_CC0                                                                                           \
        (TCC_FCTRLA_CHSEL_CC0_Val                                                                                      \
         << TCC_FCTRLA_CHSEL_Pos) /* (TCC_FCTRLA) Capture value stored in channel 0 Position  */
#define TCC_FCTRLA_CHSEL_CC1                                                                                           \
        (TCC_FCTRLA_CHSEL_CC1_Val                                                                                      \
         << TCC_FCTRLA_CHSEL_Pos) /* (TCC_FCTRLA) Capture value stored in channel 1 Position  */
#define TCC_FCTRLA_CHSEL_CC2                                                                                           \
        (TCC_FCTRLA_CHSEL_CC2_Val                                                                                      \
         << TCC_FCTRLA_CHSEL_Pos) /* (TCC_FCTRLA) Capture value stored in channel 2 Position  */
#define TCC_FCTRLA_CHSEL_CC3                                                                                           \
        (TCC_FCTRLA_CHSEL_CC3_Val                                                                                      \
         << TCC_FCTRLA_CHSEL_Pos) /* (TCC_FCTRLA) Capture value stored in channel 3 Position  */
#define TCC_FCTRLA_CAPTURE_Pos _UINT32_(12) /* (TCC_FCTRLA) Fault A Capture Action Position */
#define TCC_FCTRLA_CAPTURE_Msk (_UINT32_(0x7) << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Fault A Capture Action Mask   \
                                                                          */
#define TCC_FCTRLA_CAPTURE(value)                                                                                      \
        (TCC_FCTRLA_CAPTURE_Msk &                                                                                      \
         (_UINT32_(value) << TCC_FCTRLA_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the TCC_FCTRLA register */
#define TCC_FCTRLA_CAPTURE_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLA) No capture  */
#define TCC_FCTRLA_CAPTURE_CAPT_Val _UINT32_(0x1) /* (TCC_FCTRLA) Capture on fault  */
#define TCC_FCTRLA_CAPTURE_CAPTMIN_Val _UINT32_(0x2) /* (TCC_FCTRLA) Minimum capture  */
#define TCC_FCTRLA_CAPTURE_CAPTMAX_Val _UINT32_(0x3) /* (TCC_FCTRLA) Maximum capture  */
#define TCC_FCTRLA_CAPTURE_LOCMIN_Val _UINT32_(0x4) /* (TCC_FCTRLA) Minimum local detection  */
#define TCC_FCTRLA_CAPTURE_LOCMAX_Val _UINT32_(0x5) /* (TCC_FCTRLA) Maximum local detection  */
#define TCC_FCTRLA_CAPTURE_DERIV0_Val _UINT32_(0x6) /* (TCC_FCTRLA) Minimum and maximum local detection  */
#define TCC_FCTRLA_CAPTURE_DISABLE                                                                                     \
        (TCC_FCTRLA_CAPTURE_DISABLE_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) No capture Position  */
#define TCC_FCTRLA_CAPTURE_CAPT                                                                                        \
        (TCC_FCTRLA_CAPTURE_CAPT_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Capture on fault Position  */
#define TCC_FCTRLA_CAPTURE_CAPTMIN                                                                                     \
        (TCC_FCTRLA_CAPTURE_CAPTMIN_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Minimum capture Position  */
#define TCC_FCTRLA_CAPTURE_CAPTMAX                                                                                     \
        (TCC_FCTRLA_CAPTURE_CAPTMAX_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Maximum capture Position  */
#define TCC_FCTRLA_CAPTURE_LOCMIN                                                                                      \
        (TCC_FCTRLA_CAPTURE_LOCMIN_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Minimum local detection Position  */
#define TCC_FCTRLA_CAPTURE_LOCMAX                                                                                      \
        (TCC_FCTRLA_CAPTURE_LOCMAX_Val << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Maximum local detection Position  */
#define TCC_FCTRLA_CAPTURE_DERIV0                                                                                      \
        (                                                                                                              \
                TCC_FCTRLA_CAPTURE_DERIV0_Val                                                                          \
                << TCC_FCTRLA_CAPTURE_Pos) /* (TCC_FCTRLA) Minimum and maximum local detection Position  */
#define TCC_FCTRLA_BLANKVAL_Pos _UINT32_(16) /* (TCC_FCTRLA) Fault A Blanking Time Position */
#define TCC_FCTRLA_BLANKVAL_Msk                                                                                        \
        (_UINT32_(0xFF) << TCC_FCTRLA_BLANKVAL_Pos) /* (TCC_FCTRLA) Fault A Blanking Time Mask */
#define TCC_FCTRLA_BLANKVAL(value)                                                                                     \
        (TCC_FCTRLA_BLANKVAL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_FCTRLA_BLANKVAL_Pos)) /* Assigment of value for BLANKVAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_FILTERVAL_Pos _UINT32_(24) /* (TCC_FCTRLA) Fault A Filter Value Position */
#define TCC_FCTRLA_FILTERVAL_Msk                                                                                       \
        (_UINT32_(0xF) << TCC_FCTRLA_FILTERVAL_Pos) /* (TCC_FCTRLA) Fault A Filter Value Mask */
#define TCC_FCTRLA_FILTERVAL(value)                                                                                    \
        (TCC_FCTRLA_FILTERVAL_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << TCC_FCTRLA_FILTERVAL_Pos)) /* Assigment of value for FILTERVAL in the TCC_FCTRLA register */
#define TCC_FCTRLA_Msk _UINT32_(0x0FFF7FFB) /* (TCC_FCTRLA) Register Mask  */


/* -------- TCC_FCTRLB : (TCC Offset: 0x10) (R/W 32) Recoverable Fault B Configuration -------- */
#define TCC_FCTRLB_RESETVALUE _UINT32_(0x00) /*  (TCC_FCTRLB) Recoverable Fault B Configuration  Reset Value */

