ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_FCTRLB_SRC_Pos _UINT32_(0) /* (TCC_FCTRLB) Fault B Source Position */
#define TCC_FCTRLB_SRC_Msk (_UINT32_(0x3) << TCC_FCTRLB_SRC_Pos) /* (TCC_FCTRLB) Fault B Source Mask */
#define TCC_FCTRLB_SRC(value)                                                                                          \
        (TCC_FCTRLB_SRC_Msk &                                                                                          \
         (_UINT32_(value) << TCC_FCTRLB_SRC_Pos)) /* Assigment of value for SRC in the TCC_FCTRLB register */
#define TCC_FCTRLB_SRC_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLB) Fault input disabled  */
#define TCC_FCTRLB_SRC_ENABLE_Val _UINT32_(0x1) /* (TCC_FCTRLB) MCEx (x=0,1) event input  */
#define TCC_FCTRLB_SRC_INVERT_Val _UINT32_(0x2) /* (TCC_FCTRLB) Inverted MCEx (x=0,1) event input  */
#define TCC_FCTRLB_SRC_ALTFAULT_Val                                                                                    \
        _UINT32_(0x3) /* (TCC_FCTRLB) Alternate fault (A or B) state at the end of the previous period  */
#define TCC_FCTRLB_SRC_DISABLE                                                                                         \
        (TCC_FCTRLB_SRC_DISABLE_Val << TCC_FCTRLB_SRC_Pos) /* (TCC_FCTRLB) Fault input disabled Position  */
#define TCC_FCTRLB_SRC_ENABLE                                                                                          \
        (TCC_FCTRLB_SRC_ENABLE_Val << TCC_FCTRLB_SRC_Pos) /* (TCC_FCTRLB) MCEx (x=0,1) event input Position  */
#define TCC_FCTRLB_SRC_INVERT                                                                                          \
        (TCC_FCTRLB_SRC_INVERT_Val << TCC_FCTRLB_SRC_Pos) /* (TCC_FCTRLB) Inverted MCEx (x=0,1) event input Position   \
                                                           */
#define TCC_FCTRLB_SRC_ALTFAULT                                                                                        \
        (TCC_FCTRLB_SRC_ALTFAULT_Val << TCC_FCTRLB_SRC_Pos) /* (TCC_FCTRLB) Alternate fault (A or B) state at the end  \
                                                               of the previous period Position  */
#define TCC_FCTRLB_KEEP_Pos _UINT32_(3) /* (TCC_FCTRLB) Fault B Keeper Position */
#define TCC_FCTRLB_KEEP_Msk (_UINT32_(0x1) << TCC_FCTRLB_KEEP_Pos) /* (TCC_FCTRLB) Fault B Keeper Mask */
#define TCC_FCTRLB_KEEP(value)                                                                                         \
        (TCC_FCTRLB_KEEP_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLB_KEEP_Pos)) /* Assigment of value for KEEP in the TCC_FCTRLB register */
#define TCC_FCTRLB_QUAL_Pos _UINT32_(4) /* (TCC_FCTRLB) Fault B Qualification Position */
#define TCC_FCTRLB_QUAL_Msk (_UINT32_(0x1) << TCC_FCTRLB_QUAL_Pos) /* (TCC_FCTRLB) Fault B Qualification Mask */
#define TCC_FCTRLB_QUAL(value)                                                                                         \
        (TCC_FCTRLB_QUAL_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLB_QUAL_Pos)) /* Assigment of value for QUAL in the TCC_FCTRLB register */
#define TCC_FCTRLB_BLANK_Pos _UINT32_(5) /* (TCC_FCTRLB) Fault B Blanking Mode Position */
#define TCC_FCTRLB_BLANK_Msk (_UINT32_(0x3) << TCC_FCTRLB_BLANK_Pos) /* (TCC_FCTRLB) Fault B Blanking Mode Mask */
#define TCC_FCTRLB_BLANK(value)                                                                                        \
        (TCC_FCTRLB_BLANK_Msk &                                                                                        \
         (_UINT32_(value) << TCC_FCTRLB_BLANK_Pos)) /* Assigment of value for BLANK in the TCC_FCTRLB register */
#define TCC_FCTRLB_BLANK_NONE_Val _UINT32_(0x0) /* (TCC_FCTRLB) No blanking applied  */
#define TCC_FCTRLB_BLANK_RISE_Val                                                                                      \
        _UINT32_(0x1) /* (TCC_FCTRLB) Blanking applied from rising edge of the output waveform  */
#define TCC_FCTRLB_BLANK_FALL_Val                                                                                      \
        _UINT32_(0x2) /* (TCC_FCTRLB) Blanking applied from falling edge of the output waveform  */
#define TCC_FCTRLB_BLANK_BOTH_Val                                                                                      \
        _UINT32_(0x3) /* (TCC_FCTRLB) Blanking applied from each toggle of the output waveform  */
#define TCC_FCTRLB_BLANK_NONE                                                                                          \
        (TCC_FCTRLB_BLANK_NONE_Val << TCC_FCTRLB_BLANK_Pos) /* (TCC_FCTRLB) No blanking applied Position  */
#define TCC_FCTRLB_BLANK_RISE                                                                                          \
        (TCC_FCTRLB_BLANK_RISE_Val                                                                                     \
         << TCC_FCTRLB_BLANK_Pos) /* (TCC_FCTRLB) Blanking applied from rising edge of the output waveform Position */
#define TCC_FCTRLB_BLANK_FALL                                                                                          \
        (TCC_FCTRLB_BLANK_FALL_Val << TCC_FCTRLB_BLANK_Pos) /* (TCC_FCTRLB) Blanking applied from falling edge of the  \
                                                               output waveform Position  */
#define TCC_FCTRLB_BLANK_BOTH                                                                                          \
        (TCC_FCTRLB_BLANK_BOTH_Val                                                                                     \
         << TCC_FCTRLB_BLANK_Pos) /* (TCC_FCTRLB) Blanking applied from each toggle of the output waveform Position */
#define TCC_FCTRLB_RESTART_Pos _UINT32_(7) /* (TCC_FCTRLB) Fault B Restart Position */
#define TCC_FCTRLB_RESTART_Msk (_UINT32_(0x1) << TCC_FCTRLB_RESTART_Pos) /* (TCC_FCTRLB) Fault B Restart Mask */
#define TCC_FCTRLB_RESTART(value)                                                                                      \
        (TCC_FCTRLB_RESTART_Msk &                                                                                      \
         (_UINT32_(value) << TCC_FCTRLB_RESTART_Pos)) /* Assigment of value for RESTART in the TCC_FCTRLB register */
#define TCC_FCTRLB_HALT_Pos _UINT32_(8) /* (TCC_FCTRLB) Fault B Halt Mode Position */
#define TCC_FCTRLB_HALT_Msk (_UINT32_(0x3) << TCC_FCTRLB_HALT_Pos) /* (TCC_FCTRLB) Fault B Halt Mode Mask */
#define TCC_FCTRLB_HALT(value)                                                                                         \
        (TCC_FCTRLB_HALT_Msk &                                                                                         \
         (_UINT32_(value) << TCC_FCTRLB_HALT_Pos)) /* Assigment of value for HALT in the TCC_FCTRLB register */
#define TCC_FCTRLB_HALT_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLB) Halt action disabled  */
#define TCC_FCTRLB_HALT_HW_Val _UINT32_(0x1) /* (TCC_FCTRLB) Hardware halt action  */
#define TCC_FCTRLB_HALT_SW_Val _UINT32_(0x2) /* (TCC_FCTRLB) Software halt action  */
#define TCC_FCTRLB_HALT_NR_Val _UINT32_(0x3) /* (TCC_FCTRLB) Non-recoverable fault  */
#define TCC_FCTRLB_HALT_DISABLE                                                                                        \
        (TCC_FCTRLB_HALT_DISABLE_Val << TCC_FCTRLB_HALT_Pos) /* (TCC_FCTRLB) Halt action disabled Position  */
#define TCC_FCTRLB_HALT_HW                                                                                             \
        (TCC_FCTRLB_HALT_HW_Val << TCC_FCTRLB_HALT_Pos) /* (TCC_FCTRLB) Hardware halt action Position  */
#define TCC_FCTRLB_HALT_SW                                                                                             \
        (TCC_FCTRLB_HALT_SW_Val << TCC_FCTRLB_HALT_Pos) /* (TCC_FCTRLB) Software halt action Position  */
#define TCC_FCTRLB_HALT_NR                                                                                             \
        (TCC_FCTRLB_HALT_NR_Val << TCC_FCTRLB_HALT_Pos) /* (TCC_FCTRLB) Non-recoverable fault Position  */
#define TCC_FCTRLB_CHSEL_Pos _UINT32_(10) /* (TCC_FCTRLB) Fault B Capture Channel Position */
#define TCC_FCTRLB_CHSEL_Msk (_UINT32_(0x3) << TCC_FCTRLB_CHSEL_Pos) /* (TCC_FCTRLB) Fault B Capture Channel Mask */
#define TCC_FCTRLB_CHSEL(value)                                                                                        \
        (TCC_FCTRLB_CHSEL_Msk &                                                                                        \
         (_UINT32_(value) << TCC_FCTRLB_CHSEL_Pos)) /* Assigment of value for CHSEL in the TCC_FCTRLB register */
#define TCC_FCTRLB_CHSEL_CC0_Val _UINT32_(0x0) /* (TCC_FCTRLB) Capture value stored in channel 0  */
#define TCC_FCTRLB_CHSEL_CC1_Val _UINT32_(0x1) /* (TCC_FCTRLB) Capture value stored in channel 1  */
#define TCC_FCTRLB_CHSEL_CC2_Val _UINT32_(0x2) /* (TCC_FCTRLB) Capture value stored in channel 2  */
#define TCC_FCTRLB_CHSEL_CC3_Val _UINT32_(0x3) /* (TCC_FCTRLB) Capture value stored in channel 3  */
#define TCC_FCTRLB_CHSEL_CC0                                                                                           \
        (TCC_FCTRLB_CHSEL_CC0_Val                                                                                      \
         << TCC_FCTRLB_CHSEL_Pos) /* (TCC_FCTRLB) Capture value stored in channel 0 Position  */
#define TCC_FCTRLB_CHSEL_CC1                                                                                           \
        (TCC_FCTRLB_CHSEL_CC1_Val                                                                                      \
         << TCC_FCTRLB_CHSEL_Pos) /* (TCC_FCTRLB) Capture value stored in channel 1 Position  */
#define TCC_FCTRLB_CHSEL_CC2                                                                                           \
        (TCC_FCTRLB_CHSEL_CC2_Val                                                                                      \
         << TCC_FCTRLB_CHSEL_Pos) /* (TCC_FCTRLB) Capture value stored in channel 2 Position  */
#define TCC_FCTRLB_CHSEL_CC3                                                                                           \
        (TCC_FCTRLB_CHSEL_CC3_Val                                                                                      \
         << TCC_FCTRLB_CHSEL_Pos) /* (TCC_FCTRLB) Capture value stored in channel 3 Position  */
#define TCC_FCTRLB_CAPTURE_Pos _UINT32_(12) /* (TCC_FCTRLB) Fault B Capture Action Position */
#define TCC_FCTRLB_CAPTURE_Msk (_UINT32_(0x7) << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Fault B Capture Action Mask   \
                                                                          */
#define TCC_FCTRLB_CAPTURE(value)                                                                                      \
        (TCC_FCTRLB_CAPTURE_Msk &                                                                                      \
         (_UINT32_(value) << TCC_FCTRLB_CAPTURE_Pos)) /* Assigment of value for CAPTURE in the TCC_FCTRLB register */
#define TCC_FCTRLB_CAPTURE_DISABLE_Val _UINT32_(0x0) /* (TCC_FCTRLB) No capture  */
#define TCC_FCTRLB_CAPTURE_CAPT_Val _UINT32_(0x1) /* (TCC_FCTRLB) Capture on fault  */
#define TCC_FCTRLB_CAPTURE_CAPTMIN_Val _UINT32_(0x2) /* (TCC_FCTRLB) Minimum capture  */
#define TCC_FCTRLB_CAPTURE_CAPTMAX_Val _UINT32_(0x3) /* (TCC_FCTRLB) Maximum capture  */
#define TCC_FCTRLB_CAPTURE_LOCMIN_Val _UINT32_(0x4) /* (TCC_FCTRLB) Minimum local detection  */
#define TCC_FCTRLB_CAPTURE_LOCMAX_Val _UINT32_(0x5) /* (TCC_FCTRLB) Maximum local detection  */
#define TCC_FCTRLB_CAPTURE_DERIV0_Val _UINT32_(0x6) /* (TCC_FCTRLB) Minimum and maximum local detection  */
#define TCC_FCTRLB_CAPTURE_DISABLE                                                                                     \
        (TCC_FCTRLB_CAPTURE_DISABLE_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) No capture Position  */
#define TCC_FCTRLB_CAPTURE_CAPT                                                                                        \
        (TCC_FCTRLB_CAPTURE_CAPT_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Capture on fault Position  */
#define TCC_FCTRLB_CAPTURE_CAPTMIN                                                                                     \
        (TCC_FCTRLB_CAPTURE_CAPTMIN_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Minimum capture Position  */
#define TCC_FCTRLB_CAPTURE_CAPTMAX                                                                                     \
        (TCC_FCTRLB_CAPTURE_CAPTMAX_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Maximum capture Position  */
#define TCC_FCTRLB_CAPTURE_LOCMIN                                                                                      \
        (TCC_FCTRLB_CAPTURE_LOCMIN_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Minimum local detection Position  */
#define TCC_FCTRLB_CAPTURE_LOCMAX                                                                                      \
        (TCC_FCTRLB_CAPTURE_LOCMAX_Val << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Maximum local detection Position  */
#define TCC_FCTRLB_CAPTURE_DERIV0                                                                                      \
        (                                                                                                              \
                TCC_FCTRLB_CAPTURE_DERIV0_Val                                                                          \
                << TCC_FCTRLB_CAPTURE_Pos) /* (TCC_FCTRLB) Minimum and maximum local detection Position  */
#define TCC_FCTRLB_BLANKVAL_Pos _UINT32_(16) /* (TCC_FCTRLB) Fault B Blanking Time Position */
#define TCC_FCTRLB_BLANKVAL_Msk                                                                                        \
        (_UINT32_(0xFF) << TCC_FCTRLB_BLANKVAL_Pos) /* (TCC_FCTRLB) Fault B Blanking Time Mask */
#define TCC_FCTRLB_BLANKVAL(value)                                                                                     \
        (TCC_FCTRLB_BLANKVAL_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_FCTRLB_BLANKVAL_Pos)) /* Assigment of value for BLANKVAL in the TCC_FCTRLB register */
#define TCC_FCTRLB_FILTERVAL_Pos _UINT32_(24) /* (TCC_FCTRLB) Fault B Filter Value Position */
#define TCC_FCTRLB_FILTERVAL_Msk                                                                                       \
        (_UINT32_(0xF) << TCC_FCTRLB_FILTERVAL_Pos) /* (TCC_FCTRLB) Fault B Filter Value Mask */
#define TCC_FCTRLB_FILTERVAL(value)                                                                                    \
        (TCC_FCTRLB_FILTERVAL_Msk &                                                                                    \
         (_UINT32_(value)                                                                                              \
          << TCC_FCTRLB_FILTERVAL_Pos)) /* Assigment of value for FILTERVAL in the TCC_FCTRLB register */
#define TCC_FCTRLB_Msk _UINT32_(0x0FFF7FFB) /* (TCC_FCTRLB) Register Mask  */


/* -------- TCC_WEXCTRL : (TCC Offset: 0x14) (R/W 32) Waveform Extension Configuration -------- */
#define TCC_WEXCTRL_RESETVALUE _UINT32_(0x00) /*  (TCC_WEXCTRL) Waveform Extension Configuration  Reset Value */

