ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_DRVCTRL_Msk _UINT32_(0xFFFFFFFF) /* (TCC_DRVCTRL) Register Mask  */

#define TCC_DRVCTRL_NRE_Pos _UINT32_(0) /* (TCC_DRVCTRL Position) Non-Recoverable State x Output Enable */
#define TCC_DRVCTRL_NRE_Msk (_UINT32_(0xFF) << TCC_DRVCTRL_NRE_Pos) /* (TCC_DRVCTRL Mask) NRE */
#define TCC_DRVCTRL_NRE(value) (TCC_DRVCTRL_NRE_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRE_Pos))
#define TCC_DRVCTRL_NRV_Pos _UINT32_(8) /* (TCC_DRVCTRL Position) Non-Recoverable State x Output Value */
#define TCC_DRVCTRL_NRV_Msk (_UINT32_(0xFF) << TCC_DRVCTRL_NRV_Pos) /* (TCC_DRVCTRL Mask) NRV */
#define TCC_DRVCTRL_NRV(value) (TCC_DRVCTRL_NRV_Msk & (_UINT32_(value) << TCC_DRVCTRL_NRV_Pos))
#define TCC_DRVCTRL_INVEN_Pos _UINT32_(16) /* (TCC_DRVCTRL Position) Output Waveform x Inversion */
#define TCC_DRVCTRL_INVEN_Msk (_UINT32_(0xFF) << TCC_DRVCTRL_INVEN_Pos) /* (TCC_DRVCTRL Mask) INVEN */
#define TCC_DRVCTRL_INVEN(value) (TCC_DRVCTRL_INVEN_Msk & (_UINT32_(value) << TCC_DRVCTRL_INVEN_Pos))

/* -------- TCC_DBGCTRL : (TCC Offset: 0x1E) (R/W 8) Debug Control -------- */
#define TCC_DBGCTRL_RESETVALUE _UINT8_(0x00) /*  (TCC_DBGCTRL) Debug Control  Reset Value */

#define TCC_DBGCTRL_DBGRUN_Pos _UINT8_(0) /* (TCC_DBGCTRL) Debug Running Mode Position */
#define TCC_DBGCTRL_DBGRUN_Msk (_UINT8_(0x1) << TCC_DBGCTRL_DBGRUN_Pos) /* (TCC_DBGCTRL) Debug Running Mode Mask */
#define TCC_DBGCTRL_DBGRUN(value)                                                                                      \
        (TCC_DBGCTRL_DBGRUN_Msk &                                                                                      \
         (_UINT8_(value) << TCC_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the TCC_DBGCTRL register */
#define TCC_DBGCTRL_FDDBD_Pos _UINT8_(2) /* (TCC_DBGCTRL) Fault Detection on Debug Break Detection Position */
#define TCC_DBGCTRL_FDDBD_Msk                                                                                          \
        (_UINT8_(0x1) << TCC_DBGCTRL_FDDBD_Pos) /* (TCC_DBGCTRL) Fault Detection on Debug Break Detection Mask */
#define TCC_DBGCTRL_FDDBD(value)                                                                                       \
        (TCC_DBGCTRL_FDDBD_Msk &                                                                                       \
         (_UINT8_(value) << TCC_DBGCTRL_FDDBD_Pos)) /* Assigment of value for FDDBD in the TCC_DBGCTRL register */
#define TCC_DBGCTRL_Msk _UINT8_(0x05) /* (TCC_DBGCTRL) Register Mask  */


/* -------- TCC_EVCTRL : (TCC Offset: 0x20) (R/W 32) Event Control -------- */
#define TCC_EVCTRL_RESETVALUE _UINT32_(0x00) /*  (TCC_EVCTRL) Event Control  Reset Value */

#define TCC_EVCTRL_EVACT0_Pos _UINT32_(0) /* (TCC_EVCTRL) Timer/counter Input Event0 Action Position */
#define TCC_EVCTRL_EVACT0_Msk                                                                                          \
        (_UINT32_(0x7) << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Timer/counter Input Event0 Action Mask */
#define TCC_EVCTRL_EVACT0(value)                                                                                       \
        (TCC_EVCTRL_EVACT0_Msk &                                                                                       \
         (_UINT32_(value) << TCC_EVCTRL_EVACT0_Pos)) /* Assigment of value for EVACT0 in the TCC_EVCTRL register */
#define TCC_EVCTRL_EVACT0_OFF_Val _UINT32_(0x0) /* (TCC_EVCTRL) Event action disabled  */
#define TCC_EVCTRL_EVACT0_RETRIGGER_Val _UINT32_(0x1) /* (TCC_EVCTRL) Start, restart or re-trigger counter on event */
#define TCC_EVCTRL_EVACT0_COUNTEV_Val _UINT32_(0x2) /* (TCC_EVCTRL) Count on event  */
#define TCC_EVCTRL_EVACT0_START_Val _UINT32_(0x3) /* (TCC_EVCTRL) Start counter on event  */
#define TCC_EVCTRL_EVACT0_INC_Val _UINT32_(0x4) /* (TCC_EVCTRL) Increment counter on event  */
#define TCC_EVCTRL_EVACT0_COUNT_Val _UINT32_(0x5) /* (TCC_EVCTRL) Count on active state of asynchronous event  */
#define TCC_EVCTRL_EVACT0_FAULT_Val _UINT32_(0x7) /* (TCC_EVCTRL) Non-recoverable fault  */
#define TCC_EVCTRL_EVACT0_OFF                                                                                          \
        (TCC_EVCTRL_EVACT0_OFF_Val << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Event action disabled Position  */
#define TCC_EVCTRL_EVACT0_RETRIGGER                                                                                    \
        (                                                                                                              \
                TCC_EVCTRL_EVACT0_RETRIGGER_Val                                                                        \
                << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Start, restart or re-trigger counter on event Position  */
#define TCC_EVCTRL_EVACT0_COUNTEV                                                                                      \
        (TCC_EVCTRL_EVACT0_COUNTEV_Val << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Count on event Position  */
#define TCC_EVCTRL_EVACT0_START                                                                                        \
        (TCC_EVCTRL_EVACT0_START_Val << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Start counter on event Position  */
#define TCC_EVCTRL_EVACT0_INC                                                                                          \
        (TCC_EVCTRL_EVACT0_INC_Val << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Increment counter on event Position  */
#define TCC_EVCTRL_EVACT0_COUNT                                                                                        \
        (                                                                                                              \
                TCC_EVCTRL_EVACT0_COUNT_Val                                                                            \
                << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Count on active state of asynchronous event Position  */
#define TCC_EVCTRL_EVACT0_FAULT                                                                                        \
        (TCC_EVCTRL_EVACT0_FAULT_Val << TCC_EVCTRL_EVACT0_Pos) /* (TCC_EVCTRL) Non-recoverable fault Position  */
#define TCC_EVCTRL_EVACT1_Pos _UINT32_(3) /* (TCC_EVCTRL) Timer/counter Input Event1 Action Position */
#define TCC_EVCTRL_EVACT1_Msk                                                                                          \
        (_UINT32_(0x7) << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Timer/counter Input Event1 Action Mask */
#define TCC_EVCTRL_EVACT1(value)                                                                                       \
        (TCC_EVCTRL_EVACT1_Msk &                                                                                       \
         (_UINT32_(value) << TCC_EVCTRL_EVACT1_Pos)) /* Assigment of value for EVACT1 in the TCC_EVCTRL register */
#define TCC_EVCTRL_EVACT1_OFF_Val _UINT32_(0x0) /* (TCC_EVCTRL) Event action disabled  */
#define TCC_EVCTRL_EVACT1_RETRIGGER_Val _UINT32_(0x1) /* (TCC_EVCTRL) Re-trigger counter on event  */
#define TCC_EVCTRL_EVACT1_DIR_Val _UINT32_(0x2) /* (TCC_EVCTRL) Direction control  */
#define TCC_EVCTRL_EVACT1_STOP_Val _UINT32_(0x3) /* (TCC_EVCTRL) Stop counter on event  */
#define TCC_EVCTRL_EVACT1_DEC_Val _UINT32_(0x4) /* (TCC_EVCTRL) Decrement counter on event  */
#define TCC_EVCTRL_EVACT1_PPW_Val                                                                                      \
        _UINT32_(0x5) /* (TCC_EVCTRL) Period capture value in CC0 register, pulse width capture value in CC1 register  \
                       */
#define TCC_EVCTRL_EVACT1_PWP_Val                                                                                      \
        _UINT32_(0x6) /* (TCC_EVCTRL) Period capture value in CC1 register, pulse width capture value in CC0 register  \
                       */
#define TCC_EVCTRL_EVACT1_FAULT_Val _UINT32_(0x7) /* (TCC_EVCTRL) Non-recoverable fault  */
#define TCC_EVCTRL_EVACT1_OFF                                                                                          \
        (TCC_EVCTRL_EVACT1_OFF_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Event action disabled Position  */
#define TCC_EVCTRL_EVACT1_RETRIGGER                                                                                    \
        (                                                                                                              \
                TCC_EVCTRL_EVACT1_RETRIGGER_Val                                                                        \
                << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Re-trigger counter on event Position  */
#define TCC_EVCTRL_EVACT1_DIR                                                                                          \
        (TCC_EVCTRL_EVACT1_DIR_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Direction control Position  */
#define TCC_EVCTRL_EVACT1_STOP                                                                                         \
        (TCC_EVCTRL_EVACT1_STOP_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Stop counter on event Position  */
#define TCC_EVCTRL_EVACT1_DEC                                                                                          \
        (TCC_EVCTRL_EVACT1_DEC_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Decrement counter on event Position  */
#define TCC_EVCTRL_EVACT1_PPW                                                                                          \
        (TCC_EVCTRL_EVACT1_PPW_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Period capture value in CC0 register,     \
                                                                pulse width capture value in CC1 register Position  */
#define TCC_EVCTRL_EVACT1_PWP                                                                                          \
        (TCC_EVCTRL_EVACT1_PWP_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Period capture value in CC1 register,     \
                                                                pulse width capture value in CC0 register Position  */
#define TCC_EVCTRL_EVACT1_FAULT                                                                                        \
        (TCC_EVCTRL_EVACT1_FAULT_Val << TCC_EVCTRL_EVACT1_Pos) /* (TCC_EVCTRL) Non-recoverable fault Position  */
#define TCC_EVCTRL_CNTSEL_Pos _UINT32_(6) /* (TCC_EVCTRL) Timer/counter Output Event Mode Position */
#define TCC_EVCTRL_CNTSEL_Msk                                                                                          \
        (_UINT32_(0x3) << TCC_EVCTRL_CNTSEL_Pos) /* (TCC_EVCTRL) Timer/counter Output Event Mode Mask */
#define TCC_EVCTRL_CNTSEL(value)                                                                                       \
        (TCC_EVCTRL_CNTSEL_Msk &                                                                                       \
         (_UINT32_(value) << TCC_EVCTRL_CNTSEL_Pos)) /* Assigment of value for CNTSEL in the TCC_EVCTRL register */
#define TCC_EVCTRL_CNTSEL_START_Val                                                                                    \
        _UINT32_(0x0) /* (TCC_EVCTRL) An interrupt/event is generated when a new counter cycle starts  */
#define TCC_EVCTRL_CNTSEL_END_Val                                                                                      \
        _UINT32_(0x1) /* (TCC_EVCTRL) An interrupt/event is generated when a counter cycle ends  */
#define TCC_EVCTRL_CNTSEL_BETWEEN_Val                                                                                  \
        _UINT32_(0x2) /* (TCC_EVCTRL) An interrupt/event is generated when a counter cycle ends, except for the first  \
                         and last cycles  */
#define TCC_EVCTRL_CNTSEL_BOUNDARY_Val                                                                                 \
        _UINT32_(0x3) /* (TCC_EVCTRL) An interrupt/event is generated when a new counter cycle starts or a counter     \
                         cycle ends  */
#define TCC_EVCTRL_CNTSEL_START                                                                                        \
        (TCC_EVCTRL_CNTSEL_START_Val << TCC_EVCTRL_CNTSEL_Pos) /* (TCC_EVCTRL) An interrupt/event is generated when a  \
                                                                  new counter cycle starts Position  */
#define TCC_EVCTRL_CNTSEL_END                                                                                          \
        (TCC_EVCTRL_CNTSEL_END_Val << TCC_EVCTRL_CNTSEL_Pos) /* (TCC_EVCTRL) An interrupt/event is generated when a    \
                                                                counter cycle ends Position  */
#define TCC_EVCTRL_CNTSEL_BETWEEN                                                                                      \
        (                                                                                                              \
                TCC_EVCTRL_CNTSEL_BETWEEN_Val                                                                          \
                << TCC_EVCTRL_CNTSEL_Pos) /* (TCC_EVCTRL) An interrupt/event is generated when a counter cycle ends,   \
                                             except for the first and last cycles Position  */
#define TCC_EVCTRL_CNTSEL_BOUNDARY                                                                                     \
        (                                                                                                              \
                TCC_EVCTRL_CNTSEL_BOUNDARY_Val                                                                         \
                << TCC_EVCTRL_CNTSEL_Pos) /* (TCC_EVCTRL) An interrupt/event is generated when a new counter cycle     \
                                             starts or a counter cycle ends Position  */
#define TCC_EVCTRL_OVFEO_Pos _UINT32_(8) /* (TCC_EVCTRL) Overflow/Underflow Output Event Enable Position */
#define TCC_EVCTRL_OVFEO_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_OVFEO_Pos) /* (TCC_EVCTRL) Overflow/Underflow Output Event Enable Mask */
#define TCC_EVCTRL_OVFEO(value)                                                                                        \
        (TCC_EVCTRL_OVFEO_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_OVFEO_Pos)) /* Assigment of value for OVFEO in the TCC_EVCTRL register */
#define TCC_EVCTRL_TRGEO_Pos _UINT32_(9) /* (TCC_EVCTRL) Retrigger Output Event Enable Position */
#define TCC_EVCTRL_TRGEO_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_TRGEO_Pos) /* (TCC_EVCTRL) Retrigger Output Event Enable Mask */
#define TCC_EVCTRL_TRGEO(value)                                                                                        \
        (TCC_EVCTRL_TRGEO_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_TRGEO_Pos)) /* Assigment of value for TRGEO in the TCC_EVCTRL register */
#define TCC_EVCTRL_CNTEO_Pos _UINT32_(10) /* (TCC_EVCTRL) Timer/counter Output Event Enable Position */
#define TCC_EVCTRL_CNTEO_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_CNTEO_Pos) /* (TCC_EVCTRL) Timer/counter Output Event Enable Mask */
#define TCC_EVCTRL_CNTEO(value)                                                                                        \
        (TCC_EVCTRL_CNTEO_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_CNTEO_Pos)) /* Assigment of value for CNTEO in the TCC_EVCTRL register */
#define TCC_EVCTRL_TCINV0_Pos _UINT32_(12) /* (TCC_EVCTRL) Inverted Event 0 Input Enable Position */
#define TCC_EVCTRL_TCINV0_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_EVCTRL_TCINV0_Pos) /* (TCC_EVCTRL) Inverted Event 0 Input Enable Mask */
#define TCC_EVCTRL_TCINV0(value)                                                                                       \
        (TCC_EVCTRL_TCINV0_Msk &                                                                                       \
         (_UINT32_(value) << TCC_EVCTRL_TCINV0_Pos)) /* Assigment of value for TCINV0 in the TCC_EVCTRL register */
#define TCC_EVCTRL_TCINV1_Pos _UINT32_(13) /* (TCC_EVCTRL) Inverted Event 1 Input Enable Position */
#define TCC_EVCTRL_TCINV1_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_EVCTRL_TCINV1_Pos) /* (TCC_EVCTRL) Inverted Event 1 Input Enable Mask */
#define TCC_EVCTRL_TCINV1(value)                                                                                       \
        (TCC_EVCTRL_TCINV1_Msk &                                                                                       \
         (_UINT32_(value) << TCC_EVCTRL_TCINV1_Pos)) /* Assigment of value for TCINV1 in the TCC_EVCTRL register */
#define TCC_EVCTRL_TCEI0_Pos _UINT32_(14) /* (TCC_EVCTRL) Timer/counter Event 0 Input Enable Position */
#define TCC_EVCTRL_TCEI0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_TCEI0_Pos) /* (TCC_EVCTRL) Timer/counter Event 0 Input Enable Mask */
#define TCC_EVCTRL_TCEI0(value)                                                                                        \
        (TCC_EVCTRL_TCEI0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_TCEI0_Pos)) /* Assigment of value for TCEI0 in the TCC_EVCTRL register */
#define TCC_EVCTRL_TCEI1_Pos _UINT32_(15) /* (TCC_EVCTRL) Timer/counter Event 1 Input Enable Position */
#define TCC_EVCTRL_TCEI1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_TCEI1_Pos) /* (TCC_EVCTRL) Timer/counter Event 1 Input Enable Mask */
#define TCC_EVCTRL_TCEI1(value)                                                                                        \
        (TCC_EVCTRL_TCEI1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_TCEI1_Pos)) /* Assigment of value for TCEI1 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEI0_Pos _UINT32_(16) /* (TCC_EVCTRL) Match or Capture Channel 0 Event Input Enable Position */
#define TCC_EVCTRL_MCEI0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEI0_Pos) /* (TCC_EVCTRL) Match or Capture Channel 0 Event Input Enable Mask */
#define TCC_EVCTRL_MCEI0(value)                                                                                        \
        (TCC_EVCTRL_MCEI0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEI0_Pos)) /* Assigment of value for MCEI0 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEI1_Pos _UINT32_(17) /* (TCC_EVCTRL) Match or Capture Channel 1 Event Input Enable Position */
#define TCC_EVCTRL_MCEI1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEI1_Pos) /* (TCC_EVCTRL) Match or Capture Channel 1 Event Input Enable Mask */
#define TCC_EVCTRL_MCEI1(value)                                                                                        \
        (TCC_EVCTRL_MCEI1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEI1_Pos)) /* Assigment of value for MCEI1 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEI2_Pos _UINT32_(18) /* (TCC_EVCTRL) Match or Capture Channel 2 Event Input Enable Position */
#define TCC_EVCTRL_MCEI2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEI2_Pos) /* (TCC_EVCTRL) Match or Capture Channel 2 Event Input Enable Mask */
#define TCC_EVCTRL_MCEI2(value)                                                                                        \
        (TCC_EVCTRL_MCEI2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEI2_Pos)) /* Assigment of value for MCEI2 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEI3_Pos _UINT32_(19) /* (TCC_EVCTRL) Match or Capture Channel 3 Event Input Enable Position */
#define TCC_EVCTRL_MCEI3_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEI3_Pos) /* (TCC_EVCTRL) Match or Capture Channel 3 Event Input Enable Mask */
#define TCC_EVCTRL_MCEI3(value)                                                                                        \
        (TCC_EVCTRL_MCEI3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEI3_Pos)) /* Assigment of value for MCEI3 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEO0_Pos _UINT32_(24) /* (TCC_EVCTRL) Match or Capture Channel 0 Event Output Enable Position */
#define TCC_EVCTRL_MCEO0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEO0_Pos) /* (TCC_EVCTRL) Match or Capture Channel 0 Event Output Enable Mask */
#define TCC_EVCTRL_MCEO0(value)                                                                                        \
        (TCC_EVCTRL_MCEO0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEO0_Pos)) /* Assigment of value for MCEO0 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEO1_Pos _UINT32_(25) /* (TCC_EVCTRL) Match or Capture Channel 1 Event Output Enable Position */
#define TCC_EVCTRL_MCEO1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEO1_Pos) /* (TCC_EVCTRL) Match or Capture Channel 1 Event Output Enable Mask */
#define TCC_EVCTRL_MCEO1(value)                                                                                        \
        (TCC_EVCTRL_MCEO1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEO1_Pos)) /* Assigment of value for MCEO1 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEO2_Pos _UINT32_(26) /* (TCC_EVCTRL) Match or Capture Channel 2 Event Output Enable Position */
#define TCC_EVCTRL_MCEO2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_EVCTRL_MCEO2_Pos) /* (TCC_EVCTRL) Match or Capture Channel 2 Event Output Enable Mask */
#define TCC_EVCTRL_MCEO2(value)                                                                                        \
        (TCC_EVCTRL_MCEO2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEO2_Pos)) /* Assigment of value for MCEO2 in the TCC_EVCTRL register */
#define TCC_EVCTRL_MCEO3_Pos _UINT32_(27) /* (TCC_EVCTRL) Match or Capture Channel 3 Event Output Enable Position */
#define TCC_EVCTRL_MCEO3_Msk                                                                                           \
