ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
        (_UINT32_(0x1) << TCC_EVCTRL_MCEO3_Pos) /* (TCC_EVCTRL) Match or Capture Channel 3 Event Output Enable Mask */
#define TCC_EVCTRL_MCEO3(value)                                                                                        \
        (TCC_EVCTRL_MCEO3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_EVCTRL_MCEO3_Pos)) /* Assigment of value for MCEO3 in the TCC_EVCTRL register */
#define TCC_EVCTRL_Msk _UINT32_(0x0F0FF7FF) /* (TCC_EVCTRL) Register Mask  */

#define TCC_EVCTRL_TCINV_Pos _UINT32_(12) /* (TCC_EVCTRL Position) Inverted Event x Input Enable */
#define TCC_EVCTRL_TCINV_Msk (_UINT32_(0x3) << TCC_EVCTRL_TCINV_Pos) /* (TCC_EVCTRL Mask) TCINV */
#define TCC_EVCTRL_TCINV(value) (TCC_EVCTRL_TCINV_Msk & (_UINT32_(value) << TCC_EVCTRL_TCINV_Pos))
#define TCC_EVCTRL_TCEI_Pos _UINT32_(14) /* (TCC_EVCTRL Position) Timer/counter Event x Input Enable */
#define TCC_EVCTRL_TCEI_Msk (_UINT32_(0x3) << TCC_EVCTRL_TCEI_Pos) /* (TCC_EVCTRL Mask) TCEI */
#define TCC_EVCTRL_TCEI(value) (TCC_EVCTRL_TCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_TCEI_Pos))
#define TCC_EVCTRL_MCEI_Pos _UINT32_(16) /* (TCC_EVCTRL Position) Match or Capture Channel x Event Input Enable */
#define TCC_EVCTRL_MCEI_Msk (_UINT32_(0xF) << TCC_EVCTRL_MCEI_Pos) /* (TCC_EVCTRL Mask) MCEI */
#define TCC_EVCTRL_MCEI(value) (TCC_EVCTRL_MCEI_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEI_Pos))
#define TCC_EVCTRL_MCEO_Pos _UINT32_(24) /* (TCC_EVCTRL Position) Match or Capture Channel 3 Event Output Enable */
#define TCC_EVCTRL_MCEO_Msk (_UINT32_(0xF) << TCC_EVCTRL_MCEO_Pos) /* (TCC_EVCTRL Mask) MCEO */
#define TCC_EVCTRL_MCEO(value) (TCC_EVCTRL_MCEO_Msk & (_UINT32_(value) << TCC_EVCTRL_MCEO_Pos))

/* -------- TCC_INTENCLR : (TCC Offset: 0x24) (R/W 32) Interrupt Enable Clear -------- */
#define TCC_INTENCLR_RESETVALUE _UINT32_(0x00) /*  (TCC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define TCC_INTENCLR_OVF_Pos _UINT32_(0) /* (TCC_INTENCLR) Overflow Interrupt Enable Position */
#define TCC_INTENCLR_OVF_Msk (_UINT32_(0x1) << TCC_INTENCLR_OVF_Pos) /* (TCC_INTENCLR) Overflow Interrupt Enable Mask  \
                                                                      */
#define TCC_INTENCLR_OVF(value)                                                                                        \
        (TCC_INTENCLR_OVF_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_OVF_Pos)) /* Assigment of value for OVF in the TCC_INTENCLR register */
#define TCC_INTENCLR_TRG_Pos _UINT32_(1) /* (TCC_INTENCLR) Retrigger Interrupt Enable Position */
#define TCC_INTENCLR_TRG_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_TRG_Pos) /* (TCC_INTENCLR) Retrigger Interrupt Enable Mask */
#define TCC_INTENCLR_TRG(value)                                                                                        \
        (TCC_INTENCLR_TRG_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_TRG_Pos)) /* Assigment of value for TRG in the TCC_INTENCLR register */
#define TCC_INTENCLR_CNT_Pos _UINT32_(2) /* (TCC_INTENCLR) Counter Interrupt Enable Position */
#define TCC_INTENCLR_CNT_Msk (_UINT32_(0x1) << TCC_INTENCLR_CNT_Pos) /* (TCC_INTENCLR) Counter Interrupt Enable Mask   \
                                                                      */
#define TCC_INTENCLR_CNT(value)                                                                                        \
        (TCC_INTENCLR_CNT_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_CNT_Pos)) /* Assigment of value for CNT in the TCC_INTENCLR register */
#define TCC_INTENCLR_ERR_Pos _UINT32_(3) /* (TCC_INTENCLR) Error Interrupt Enable Position */
#define TCC_INTENCLR_ERR_Msk (_UINT32_(0x1) << TCC_INTENCLR_ERR_Pos) /* (TCC_INTENCLR) Error Interrupt Enable Mask */
#define TCC_INTENCLR_ERR(value)                                                                                        \
        (TCC_INTENCLR_ERR_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_ERR_Pos)) /* Assigment of value for ERR in the TCC_INTENCLR register */
#define TCC_INTENCLR_DFS_Pos _UINT32_(11) /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Position */
#define TCC_INTENCLR_DFS_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_DFS_Pos) /* (TCC_INTENCLR) Non-Recoverable Debug Fault Interrupt Enable Mask */
#define TCC_INTENCLR_DFS(value)                                                                                        \
        (TCC_INTENCLR_DFS_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_DFS_Pos)) /* Assigment of value for DFS in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTA_Pos _UINT32_(12) /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Position */
#define TCC_INTENCLR_FAULTA_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENCLR_FAULTA_Pos) /* (TCC_INTENCLR) Recoverable Fault A Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTA(value)                                                                                     \
        (TCC_INTENCLR_FAULTA_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENCLR_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULTB_Pos _UINT32_(13) /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Position */
#define TCC_INTENCLR_FAULTB_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENCLR_FAULTB_Pos) /* (TCC_INTENCLR) Recoverable Fault B Interrupt Enable Mask */
#define TCC_INTENCLR_FAULTB(value)                                                                                     \
        (TCC_INTENCLR_FAULTB_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENCLR_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT0_Pos _UINT32_(14) /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT0_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENCLR_FAULT0_Pos) /* (TCC_INTENCLR) Non-Recoverable Fault 0 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT0(value)                                                                                     \
        (TCC_INTENCLR_FAULT0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENCLR_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_FAULT1_Pos _UINT32_(15) /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Position */
#define TCC_INTENCLR_FAULT1_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENCLR_FAULT1_Pos) /* (TCC_INTENCLR) Non-Recoverable Fault 1 Interrupt Enable Mask */
#define TCC_INTENCLR_FAULT1(value)                                                                                     \
        (TCC_INTENCLR_FAULT1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENCLR_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC0_Pos _UINT32_(16) /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Position */
#define TCC_INTENCLR_MC0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_MC0_Pos) /* (TCC_INTENCLR) Match or Capture Channel 0 Interrupt Enable Mask */
#define TCC_INTENCLR_MC0(value)                                                                                        \
        (TCC_INTENCLR_MC0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_MC0_Pos)) /* Assigment of value for MC0 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC1_Pos _UINT32_(17) /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Position */
#define TCC_INTENCLR_MC1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_MC1_Pos) /* (TCC_INTENCLR) Match or Capture Channel 1 Interrupt Enable Mask */
#define TCC_INTENCLR_MC1(value)                                                                                        \
        (TCC_INTENCLR_MC1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_MC1_Pos)) /* Assigment of value for MC1 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC2_Pos _UINT32_(18) /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Position */
#define TCC_INTENCLR_MC2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_MC2_Pos) /* (TCC_INTENCLR) Match or Capture Channel 2 Interrupt Enable Mask */
#define TCC_INTENCLR_MC2(value)                                                                                        \
        (TCC_INTENCLR_MC2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_MC2_Pos)) /* Assigment of value for MC2 in the TCC_INTENCLR register */
#define TCC_INTENCLR_MC3_Pos _UINT32_(19) /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Position */
#define TCC_INTENCLR_MC3_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENCLR_MC3_Pos) /* (TCC_INTENCLR) Match or Capture Channel 3 Interrupt Enable Mask */
#define TCC_INTENCLR_MC3(value)                                                                                        \
        (TCC_INTENCLR_MC3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENCLR_MC3_Pos)) /* Assigment of value for MC3 in the TCC_INTENCLR register */
#define TCC_INTENCLR_Msk _UINT32_(0x000FF80F) /* (TCC_INTENCLR) Register Mask  */

#define TCC_INTENCLR_FAULT_Pos _UINT32_(14) /* (TCC_INTENCLR Position) Non-Recoverable Fault x Interrupt Enable */
#define TCC_INTENCLR_FAULT_Msk (_UINT32_(0x3) << TCC_INTENCLR_FAULT_Pos) /* (TCC_INTENCLR Mask) FAULT */
#define TCC_INTENCLR_FAULT(value) (TCC_INTENCLR_FAULT_Msk & (_UINT32_(value) << TCC_INTENCLR_FAULT_Pos))
#define TCC_INTENCLR_MC_Pos _UINT32_(16) /* (TCC_INTENCLR Position) Match or Capture Channel 3 Interrupt Enable */
#define TCC_INTENCLR_MC_Msk (_UINT32_(0xF) << TCC_INTENCLR_MC_Pos) /* (TCC_INTENCLR Mask) MC */
#define TCC_INTENCLR_MC(value) (TCC_INTENCLR_MC_Msk & (_UINT32_(value) << TCC_INTENCLR_MC_Pos))

/* -------- TCC_INTENSET : (TCC Offset: 0x28) (R/W 32) Interrupt Enable Set -------- */
#define TCC_INTENSET_RESETVALUE _UINT32_(0x00) /*  (TCC_INTENSET) Interrupt Enable Set  Reset Value */

#define TCC_INTENSET_OVF_Pos _UINT32_(0) /* (TCC_INTENSET) Overflow Interrupt Enable Position */
#define TCC_INTENSET_OVF_Msk (_UINT32_(0x1) << TCC_INTENSET_OVF_Pos) /* (TCC_INTENSET) Overflow Interrupt Enable Mask  \
                                                                      */
#define TCC_INTENSET_OVF(value)                                                                                        \
        (TCC_INTENSET_OVF_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_OVF_Pos)) /* Assigment of value for OVF in the TCC_INTENSET register */
#define TCC_INTENSET_TRG_Pos _UINT32_(1) /* (TCC_INTENSET) Retrigger Interrupt Enable Position */
#define TCC_INTENSET_TRG_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_TRG_Pos) /* (TCC_INTENSET) Retrigger Interrupt Enable Mask */
#define TCC_INTENSET_TRG(value)                                                                                        \
        (TCC_INTENSET_TRG_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_TRG_Pos)) /* Assigment of value for TRG in the TCC_INTENSET register */
#define TCC_INTENSET_CNT_Pos _UINT32_(2) /* (TCC_INTENSET) Counter Interrupt Enable Position */
#define TCC_INTENSET_CNT_Msk (_UINT32_(0x1) << TCC_INTENSET_CNT_Pos) /* (TCC_INTENSET) Counter Interrupt Enable Mask   \
                                                                      */
#define TCC_INTENSET_CNT(value)                                                                                        \
        (TCC_INTENSET_CNT_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_CNT_Pos)) /* Assigment of value for CNT in the TCC_INTENSET register */
#define TCC_INTENSET_ERR_Pos _UINT32_(3) /* (TCC_INTENSET) Error Interrupt Enable Position */
#define TCC_INTENSET_ERR_Msk (_UINT32_(0x1) << TCC_INTENSET_ERR_Pos) /* (TCC_INTENSET) Error Interrupt Enable Mask */
#define TCC_INTENSET_ERR(value)                                                                                        \
        (TCC_INTENSET_ERR_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_ERR_Pos)) /* Assigment of value for ERR in the TCC_INTENSET register */
#define TCC_INTENSET_DFS_Pos _UINT32_(11) /* (TCC_INTENSET) Non-Recoverable Debug Fault Interrupt Enable Position */
#define TCC_INTENSET_DFS_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_DFS_Pos) /* (TCC_INTENSET) Non-Recoverable Debug Fault Interrupt Enable Mask */
#define TCC_INTENSET_DFS(value)                                                                                        \
        (TCC_INTENSET_DFS_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_DFS_Pos)) /* Assigment of value for DFS in the TCC_INTENSET register */
#define TCC_INTENSET_FAULTA_Pos _UINT32_(12) /* (TCC_INTENSET) Recoverable Fault A Interrupt Enable Position */
#define TCC_INTENSET_FAULTA_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENSET_FAULTA_Pos) /* (TCC_INTENSET) Recoverable Fault A Interrupt Enable Mask */
#define TCC_INTENSET_FAULTA(value)                                                                                     \
        (TCC_INTENSET_FAULTA_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENSET_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_INTENSET register */
#define TCC_INTENSET_FAULTB_Pos _UINT32_(13) /* (TCC_INTENSET) Recoverable Fault B Interrupt Enable Position */
#define TCC_INTENSET_FAULTB_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENSET_FAULTB_Pos) /* (TCC_INTENSET) Recoverable Fault B Interrupt Enable Mask */
#define TCC_INTENSET_FAULTB(value)                                                                                     \
        (TCC_INTENSET_FAULTB_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENSET_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_INTENSET register */
#define TCC_INTENSET_FAULT0_Pos _UINT32_(14) /* (TCC_INTENSET) Non-Recoverable Fault 0 Interrupt Enable Position */
#define TCC_INTENSET_FAULT0_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENSET_FAULT0_Pos) /* (TCC_INTENSET) Non-Recoverable Fault 0 Interrupt Enable Mask */
#define TCC_INTENSET_FAULT0(value)                                                                                     \
        (TCC_INTENSET_FAULT0_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENSET_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_INTENSET register */
#define TCC_INTENSET_FAULT1_Pos _UINT32_(15) /* (TCC_INTENSET) Non-Recoverable Fault 1 Interrupt Enable Position */
#define TCC_INTENSET_FAULT1_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_INTENSET_FAULT1_Pos) /* (TCC_INTENSET) Non-Recoverable Fault 1 Interrupt Enable Mask */
#define TCC_INTENSET_FAULT1(value)                                                                                     \
        (TCC_INTENSET_FAULT1_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_INTENSET_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_INTENSET register */
#define TCC_INTENSET_MC0_Pos _UINT32_(16) /* (TCC_INTENSET) Match or Capture Channel 0 Interrupt Enable Position */
#define TCC_INTENSET_MC0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_MC0_Pos) /* (TCC_INTENSET) Match or Capture Channel 0 Interrupt Enable Mask */
#define TCC_INTENSET_MC0(value)                                                                                        \
        (TCC_INTENSET_MC0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_MC0_Pos)) /* Assigment of value for MC0 in the TCC_INTENSET register */
#define TCC_INTENSET_MC1_Pos _UINT32_(17) /* (TCC_INTENSET) Match or Capture Channel 1 Interrupt Enable Position */
#define TCC_INTENSET_MC1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_MC1_Pos) /* (TCC_INTENSET) Match or Capture Channel 1 Interrupt Enable Mask */
#define TCC_INTENSET_MC1(value)                                                                                        \
        (TCC_INTENSET_MC1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_MC1_Pos)) /* Assigment of value for MC1 in the TCC_INTENSET register */
#define TCC_INTENSET_MC2_Pos _UINT32_(18) /* (TCC_INTENSET) Match or Capture Channel 2 Interrupt Enable Position */
#define TCC_INTENSET_MC2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_MC2_Pos) /* (TCC_INTENSET) Match or Capture Channel 2 Interrupt Enable Mask */
#define TCC_INTENSET_MC2(value)                                                                                        \
        (TCC_INTENSET_MC2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_MC2_Pos)) /* Assigment of value for MC2 in the TCC_INTENSET register */
#define TCC_INTENSET_MC3_Pos _UINT32_(19) /* (TCC_INTENSET) Match or Capture Channel 3 Interrupt Enable Position */
#define TCC_INTENSET_MC3_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_INTENSET_MC3_Pos) /* (TCC_INTENSET) Match or Capture Channel 3 Interrupt Enable Mask */
#define TCC_INTENSET_MC3(value)                                                                                        \
        (TCC_INTENSET_MC3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_INTENSET_MC3_Pos)) /* Assigment of value for MC3 in the TCC_INTENSET register */
#define TCC_INTENSET_Msk _UINT32_(0x000FF80F) /* (TCC_INTENSET) Register Mask  */

#define TCC_INTENSET_FAULT_Pos _UINT32_(14) /* (TCC_INTENSET Position) Non-Recoverable Fault x Interrupt Enable */
#define TCC_INTENSET_FAULT_Msk (_UINT32_(0x3) << TCC_INTENSET_FAULT_Pos) /* (TCC_INTENSET Mask) FAULT */
#define TCC_INTENSET_FAULT(value) (TCC_INTENSET_FAULT_Msk & (_UINT32_(value) << TCC_INTENSET_FAULT_Pos))
#define TCC_INTENSET_MC_Pos _UINT32_(16) /* (TCC_INTENSET Position) Match or Capture Channel 3 Interrupt Enable */
#define TCC_INTENSET_MC_Msk (_UINT32_(0xF) << TCC_INTENSET_MC_Pos) /* (TCC_INTENSET Mask) MC */
#define TCC_INTENSET_MC(value) (TCC_INTENSET_MC_Msk & (_UINT32_(value) << TCC_INTENSET_MC_Pos))

/* -------- TCC_INTFLAG : (TCC Offset: 0x2C) (R/W 32) Interrupt Flag Status and Clear -------- */
#define TCC_INTFLAG_RESETVALUE _UINT32_(0x00) /*  (TCC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

