ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_INTFLAG_OVF_Pos _UINT32_(0) /* (TCC_INTFLAG) Overflow Position */
#define TCC_INTFLAG_OVF_Msk (_UINT32_(0x1) << TCC_INTFLAG_OVF_Pos) /* (TCC_INTFLAG) Overflow Mask */
#define TCC_INTFLAG_OVF(value)                                                                                         \
        (TCC_INTFLAG_OVF_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_OVF_Pos)) /* Assigment of value for OVF in the TCC_INTFLAG register */
#define TCC_INTFLAG_TRG_Pos _UINT32_(1) /* (TCC_INTFLAG) Retrigger Position */
#define TCC_INTFLAG_TRG_Msk (_UINT32_(0x1) << TCC_INTFLAG_TRG_Pos) /* (TCC_INTFLAG) Retrigger Mask */
#define TCC_INTFLAG_TRG(value)                                                                                         \
        (TCC_INTFLAG_TRG_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_TRG_Pos)) /* Assigment of value for TRG in the TCC_INTFLAG register */
#define TCC_INTFLAG_CNT_Pos _UINT32_(2) /* (TCC_INTFLAG) Counter Position */
#define TCC_INTFLAG_CNT_Msk (_UINT32_(0x1) << TCC_INTFLAG_CNT_Pos) /* (TCC_INTFLAG) Counter Mask */
#define TCC_INTFLAG_CNT(value)                                                                                         \
        (TCC_INTFLAG_CNT_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_CNT_Pos)) /* Assigment of value for CNT in the TCC_INTFLAG register */
#define TCC_INTFLAG_ERR_Pos _UINT32_(3) /* (TCC_INTFLAG) Error Position */
#define TCC_INTFLAG_ERR_Msk (_UINT32_(0x1) << TCC_INTFLAG_ERR_Pos) /* (TCC_INTFLAG) Error Mask */
#define TCC_INTFLAG_ERR(value)                                                                                         \
        (TCC_INTFLAG_ERR_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_ERR_Pos)) /* Assigment of value for ERR in the TCC_INTFLAG register */
#define TCC_INTFLAG_DFS_Pos _UINT32_(11) /* (TCC_INTFLAG) Non-Recoverable Debug Fault Position */
#define TCC_INTFLAG_DFS_Msk (_UINT32_(0x1) << TCC_INTFLAG_DFS_Pos) /* (TCC_INTFLAG) Non-Recoverable Debug Fault Mask   \
                                                                    */
#define TCC_INTFLAG_DFS(value)                                                                                         \
        (TCC_INTFLAG_DFS_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_DFS_Pos)) /* Assigment of value for DFS in the TCC_INTFLAG register */
#define TCC_INTFLAG_FAULTA_Pos _UINT32_(12) /* (TCC_INTFLAG) Recoverable Fault A Position */
#define TCC_INTFLAG_FAULTA_Msk (_UINT32_(0x1) << TCC_INTFLAG_FAULTA_Pos) /* (TCC_INTFLAG) Recoverable Fault A Mask */
#define TCC_INTFLAG_FAULTA(value)                                                                                      \
        (TCC_INTFLAG_FAULTA_Msk &                                                                                      \
         (_UINT32_(value) << TCC_INTFLAG_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_INTFLAG register */
#define TCC_INTFLAG_FAULTB_Pos _UINT32_(13) /* (TCC_INTFLAG) Recoverable Fault B Position */
#define TCC_INTFLAG_FAULTB_Msk (_UINT32_(0x1) << TCC_INTFLAG_FAULTB_Pos) /* (TCC_INTFLAG) Recoverable Fault B Mask */
#define TCC_INTFLAG_FAULTB(value)                                                                                      \
        (TCC_INTFLAG_FAULTB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_INTFLAG_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_INTFLAG register */
#define TCC_INTFLAG_FAULT0_Pos _UINT32_(14) /* (TCC_INTFLAG) Non-Recoverable Fault 0 Position */
#define TCC_INTFLAG_FAULT0_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_INTFLAG_FAULT0_Pos) /* (TCC_INTFLAG) Non-Recoverable Fault 0 Mask */
#define TCC_INTFLAG_FAULT0(value)                                                                                      \
        (TCC_INTFLAG_FAULT0_Msk &                                                                                      \
         (_UINT32_(value) << TCC_INTFLAG_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_INTFLAG register */
#define TCC_INTFLAG_FAULT1_Pos _UINT32_(15) /* (TCC_INTFLAG) Non-Recoverable Fault 1 Position */
#define TCC_INTFLAG_FAULT1_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_INTFLAG_FAULT1_Pos) /* (TCC_INTFLAG) Non-Recoverable Fault 1 Mask */
#define TCC_INTFLAG_FAULT1(value)                                                                                      \
        (TCC_INTFLAG_FAULT1_Msk &                                                                                      \
         (_UINT32_(value) << TCC_INTFLAG_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_INTFLAG register */
#define TCC_INTFLAG_MC0_Pos _UINT32_(16) /* (TCC_INTFLAG) Match or Capture 0 Position */
#define TCC_INTFLAG_MC0_Msk (_UINT32_(0x1) << TCC_INTFLAG_MC0_Pos) /* (TCC_INTFLAG) Match or Capture 0 Mask */
#define TCC_INTFLAG_MC0(value)                                                                                         \
        (TCC_INTFLAG_MC0_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_MC0_Pos)) /* Assigment of value for MC0 in the TCC_INTFLAG register */
#define TCC_INTFLAG_MC1_Pos _UINT32_(17) /* (TCC_INTFLAG) Match or Capture 1 Position */
#define TCC_INTFLAG_MC1_Msk (_UINT32_(0x1) << TCC_INTFLAG_MC1_Pos) /* (TCC_INTFLAG) Match or Capture 1 Mask */
#define TCC_INTFLAG_MC1(value)                                                                                         \
        (TCC_INTFLAG_MC1_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_MC1_Pos)) /* Assigment of value for MC1 in the TCC_INTFLAG register */
#define TCC_INTFLAG_MC2_Pos _UINT32_(18) /* (TCC_INTFLAG) Match or Capture 2 Position */
#define TCC_INTFLAG_MC2_Msk (_UINT32_(0x1) << TCC_INTFLAG_MC2_Pos) /* (TCC_INTFLAG) Match or Capture 2 Mask */
#define TCC_INTFLAG_MC2(value)                                                                                         \
        (TCC_INTFLAG_MC2_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_MC2_Pos)) /* Assigment of value for MC2 in the TCC_INTFLAG register */
#define TCC_INTFLAG_MC3_Pos _UINT32_(19) /* (TCC_INTFLAG) Match or Capture 3 Position */
#define TCC_INTFLAG_MC3_Msk (_UINT32_(0x1) << TCC_INTFLAG_MC3_Pos) /* (TCC_INTFLAG) Match or Capture 3 Mask */
#define TCC_INTFLAG_MC3(value)                                                                                         \
        (TCC_INTFLAG_MC3_Msk &                                                                                         \
         (_UINT32_(value) << TCC_INTFLAG_MC3_Pos)) /* Assigment of value for MC3 in the TCC_INTFLAG register */
#define TCC_INTFLAG_Msk _UINT32_(0x000FF80F) /* (TCC_INTFLAG) Register Mask  */

#define TCC_INTFLAG_FAULT_Pos _UINT32_(14) /* (TCC_INTFLAG Position) Non-Recoverable Fault x */
#define TCC_INTFLAG_FAULT_Msk (_UINT32_(0x3) << TCC_INTFLAG_FAULT_Pos) /* (TCC_INTFLAG Mask) FAULT */
#define TCC_INTFLAG_FAULT(value) (TCC_INTFLAG_FAULT_Msk & (_UINT32_(value) << TCC_INTFLAG_FAULT_Pos))
#define TCC_INTFLAG_MC_Pos _UINT32_(16) /* (TCC_INTFLAG Position) Match or Capture 3 */
#define TCC_INTFLAG_MC_Msk (_UINT32_(0xF) << TCC_INTFLAG_MC_Pos) /* (TCC_INTFLAG Mask) MC */
#define TCC_INTFLAG_MC(value) (TCC_INTFLAG_MC_Msk & (_UINT32_(value) << TCC_INTFLAG_MC_Pos))

