ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/* -------- TCC_STATUS : (TCC Offset: 0x30) (R/W 32) Status -------- */
#define TCC_STATUS_RESETVALUE _UINT32_(0x01) /*  (TCC_STATUS) Status  Reset Value */

#define TCC_STATUS_STOP_Pos _UINT32_(0) /* (TCC_STATUS) Stop Position */
#define TCC_STATUS_STOP_Msk (_UINT32_(0x1) << TCC_STATUS_STOP_Pos) /* (TCC_STATUS) Stop Mask */
#define TCC_STATUS_STOP(value)                                                                                         \
        (TCC_STATUS_STOP_Msk &                                                                                         \
         (_UINT32_(value) << TCC_STATUS_STOP_Pos)) /* Assigment of value for STOP in the TCC_STATUS register */
#define TCC_STATUS_IDX_Pos _UINT32_(1) /* (TCC_STATUS) Ramp Position */
#define TCC_STATUS_IDX_Msk (_UINT32_(0x1) << TCC_STATUS_IDX_Pos) /* (TCC_STATUS) Ramp Mask */
#define TCC_STATUS_IDX(value)                                                                                          \
        (TCC_STATUS_IDX_Msk &                                                                                          \
         (_UINT32_(value) << TCC_STATUS_IDX_Pos)) /* Assigment of value for IDX in the TCC_STATUS register */
#define TCC_STATUS_DFS_Pos _UINT32_(3) /* (TCC_STATUS) Non-Recoverable Debug Fault State Position */
#define TCC_STATUS_DFS_Msk                                                                                             \
        (_UINT32_(0x1) << TCC_STATUS_DFS_Pos) /* (TCC_STATUS) Non-Recoverable Debug Fault State Mask */
#define TCC_STATUS_DFS(value)                                                                                          \
        (TCC_STATUS_DFS_Msk &                                                                                          \
         (_UINT32_(value) << TCC_STATUS_DFS_Pos)) /* Assigment of value for DFS in the TCC_STATUS register */
#define TCC_STATUS_SLAVE_Pos _UINT32_(4) /* (TCC_STATUS) Slave Position */
#define TCC_STATUS_SLAVE_Msk (_UINT32_(0x1) << TCC_STATUS_SLAVE_Pos) /* (TCC_STATUS) Slave Mask */
#define TCC_STATUS_SLAVE(value)                                                                                        \
        (TCC_STATUS_SLAVE_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_SLAVE_Pos)) /* Assigment of value for SLAVE in the TCC_STATUS register */
#define TCC_STATUS_PATTBV_Pos _UINT32_(5) /* (TCC_STATUS) Pattern Buffer Valid Position */
#define TCC_STATUS_PATTBV_Msk (_UINT32_(0x1) << TCC_STATUS_PATTBV_Pos) /* (TCC_STATUS) Pattern Buffer Valid Mask */
#define TCC_STATUS_PATTBV(value)                                                                                       \
        (TCC_STATUS_PATTBV_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_PATTBV_Pos)) /* Assigment of value for PATTBV in the TCC_STATUS register */
#define TCC_STATUS_WAVEBV_Pos _UINT32_(6) /* (TCC_STATUS) Wave Buffer Valid Position */
#define TCC_STATUS_WAVEBV_Msk (_UINT32_(0x1) << TCC_STATUS_WAVEBV_Pos) /* (TCC_STATUS) Wave Buffer Valid Mask */
#define TCC_STATUS_WAVEBV(value)                                                                                       \
        (TCC_STATUS_WAVEBV_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_WAVEBV_Pos)) /* Assigment of value for WAVEBV in the TCC_STATUS register */
#define TCC_STATUS_PERBV_Pos _UINT32_(7) /* (TCC_STATUS) Period Buffer Valid Position */
#define TCC_STATUS_PERBV_Msk (_UINT32_(0x1) << TCC_STATUS_PERBV_Pos) /* (TCC_STATUS) Period Buffer Valid Mask */
#define TCC_STATUS_PERBV(value)                                                                                        \
        (TCC_STATUS_PERBV_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_PERBV_Pos)) /* Assigment of value for PERBV in the TCC_STATUS register */
#define TCC_STATUS_FAULTAIN_Pos _UINT32_(8) /* (TCC_STATUS) Recoverable Fault A Input Position */
#define TCC_STATUS_FAULTAIN_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_STATUS_FAULTAIN_Pos) /* (TCC_STATUS) Recoverable Fault A Input Mask */
#define TCC_STATUS_FAULTAIN(value)                                                                                     \
        (TCC_STATUS_FAULTAIN_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_STATUS_FAULTAIN_Pos)) /* Assigment of value for FAULTAIN in the TCC_STATUS register */
#define TCC_STATUS_FAULTBIN_Pos _UINT32_(9) /* (TCC_STATUS) Recoverable Fault B Input Position */
#define TCC_STATUS_FAULTBIN_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_STATUS_FAULTBIN_Pos) /* (TCC_STATUS) Recoverable Fault B Input Mask */
#define TCC_STATUS_FAULTBIN(value)                                                                                     \
        (TCC_STATUS_FAULTBIN_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_STATUS_FAULTBIN_Pos)) /* Assigment of value for FAULTBIN in the TCC_STATUS register */
#define TCC_STATUS_FAULT0IN_Pos _UINT32_(10) /* (TCC_STATUS) Non-Recoverable Fault0 Input Position */
#define TCC_STATUS_FAULT0IN_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_STATUS_FAULT0IN_Pos) /* (TCC_STATUS) Non-Recoverable Fault0 Input Mask */
#define TCC_STATUS_FAULT0IN(value)                                                                                     \
        (TCC_STATUS_FAULT0IN_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_STATUS_FAULT0IN_Pos)) /* Assigment of value for FAULT0IN in the TCC_STATUS register */
#define TCC_STATUS_FAULT1IN_Pos _UINT32_(11) /* (TCC_STATUS) Non-Recoverable Fault1 Input Position */
#define TCC_STATUS_FAULT1IN_Msk                                                                                        \
        (_UINT32_(0x1) << TCC_STATUS_FAULT1IN_Pos) /* (TCC_STATUS) Non-Recoverable Fault1 Input Mask */
#define TCC_STATUS_FAULT1IN(value)                                                                                     \
        (TCC_STATUS_FAULT1IN_Msk &                                                                                     \
         (_UINT32_(value)                                                                                              \
          << TCC_STATUS_FAULT1IN_Pos)) /* Assigment of value for FAULT1IN in the TCC_STATUS register */
#define TCC_STATUS_FAULTA_Pos _UINT32_(12) /* (TCC_STATUS) Recoverable Fault A State Position */
#define TCC_STATUS_FAULTA_Msk (_UINT32_(0x1) << TCC_STATUS_FAULTA_Pos) /* (TCC_STATUS) Recoverable Fault A State Mask  \
                                                                        */
#define TCC_STATUS_FAULTA(value)                                                                                       \
        (TCC_STATUS_FAULTA_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_FAULTA_Pos)) /* Assigment of value for FAULTA in the TCC_STATUS register */
#define TCC_STATUS_FAULTB_Pos _UINT32_(13) /* (TCC_STATUS) Recoverable Fault B State Position */
#define TCC_STATUS_FAULTB_Msk (_UINT32_(0x1) << TCC_STATUS_FAULTB_Pos) /* (TCC_STATUS) Recoverable Fault B State Mask  \
                                                                        */
#define TCC_STATUS_FAULTB(value)                                                                                       \
        (TCC_STATUS_FAULTB_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_FAULTB_Pos)) /* Assigment of value for FAULTB in the TCC_STATUS register */
#define TCC_STATUS_FAULT0_Pos _UINT32_(14) /* (TCC_STATUS) Non-Recoverable Fault 0 State Position */
#define TCC_STATUS_FAULT0_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_STATUS_FAULT0_Pos) /* (TCC_STATUS) Non-Recoverable Fault 0 State Mask */
#define TCC_STATUS_FAULT0(value)                                                                                       \
        (TCC_STATUS_FAULT0_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_FAULT0_Pos)) /* Assigment of value for FAULT0 in the TCC_STATUS register */
#define TCC_STATUS_FAULT1_Pos _UINT32_(15) /* (TCC_STATUS) Non-Recoverable Fault 1 State Position */
#define TCC_STATUS_FAULT1_Msk                                                                                          \
        (_UINT32_(0x1) << TCC_STATUS_FAULT1_Pos) /* (TCC_STATUS) Non-Recoverable Fault 1 State Mask */
#define TCC_STATUS_FAULT1(value)                                                                                       \
        (TCC_STATUS_FAULT1_Msk &                                                                                       \
         (_UINT32_(value) << TCC_STATUS_FAULT1_Pos)) /* Assigment of value for FAULT1 in the TCC_STATUS register */
#define TCC_STATUS_CCBV0_Pos _UINT32_(16) /* (TCC_STATUS) Compare Channel 0 Buffer Valid Position */
#define TCC_STATUS_CCBV0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_STATUS_CCBV0_Pos) /* (TCC_STATUS) Compare Channel 0 Buffer Valid Mask */
#define TCC_STATUS_CCBV0(value)                                                                                        \
        (TCC_STATUS_CCBV0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_CCBV0_Pos)) /* Assigment of value for CCBV0 in the TCC_STATUS register */
#define TCC_STATUS_CCBV1_Pos _UINT32_(17) /* (TCC_STATUS) Compare Channel 1 Buffer Valid Position */
#define TCC_STATUS_CCBV1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_STATUS_CCBV1_Pos) /* (TCC_STATUS) Compare Channel 1 Buffer Valid Mask */
#define TCC_STATUS_CCBV1(value)                                                                                        \
        (TCC_STATUS_CCBV1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_CCBV1_Pos)) /* Assigment of value for CCBV1 in the TCC_STATUS register */
#define TCC_STATUS_CCBV2_Pos _UINT32_(18) /* (TCC_STATUS) Compare Channel 2 Buffer Valid Position */
#define TCC_STATUS_CCBV2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_STATUS_CCBV2_Pos) /* (TCC_STATUS) Compare Channel 2 Buffer Valid Mask */
#define TCC_STATUS_CCBV2(value)                                                                                        \
        (TCC_STATUS_CCBV2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_CCBV2_Pos)) /* Assigment of value for CCBV2 in the TCC_STATUS register */
#define TCC_STATUS_CCBV3_Pos _UINT32_(19) /* (TCC_STATUS) Compare Channel 3 Buffer Valid Position */
#define TCC_STATUS_CCBV3_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_STATUS_CCBV3_Pos) /* (TCC_STATUS) Compare Channel 3 Buffer Valid Mask */
#define TCC_STATUS_CCBV3(value)                                                                                        \
        (TCC_STATUS_CCBV3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_STATUS_CCBV3_Pos)) /* Assigment of value for CCBV3 in the TCC_STATUS register */
#define TCC_STATUS_CMP0_Pos _UINT32_(24) /* (TCC_STATUS) Compare Channel 0 Value Position */
#define TCC_STATUS_CMP0_Msk (_UINT32_(0x1) << TCC_STATUS_CMP0_Pos) /* (TCC_STATUS) Compare Channel 0 Value Mask */
#define TCC_STATUS_CMP0(value)                                                                                         \
        (TCC_STATUS_CMP0_Msk &                                                                                         \
         (_UINT32_(value) << TCC_STATUS_CMP0_Pos)) /* Assigment of value for CMP0 in the TCC_STATUS register */
#define TCC_STATUS_CMP1_Pos _UINT32_(25) /* (TCC_STATUS) Compare Channel 1 Value Position */
#define TCC_STATUS_CMP1_Msk (_UINT32_(0x1) << TCC_STATUS_CMP1_Pos) /* (TCC_STATUS) Compare Channel 1 Value Mask */
#define TCC_STATUS_CMP1(value)                                                                                         \
        (TCC_STATUS_CMP1_Msk &                                                                                         \
         (_UINT32_(value) << TCC_STATUS_CMP1_Pos)) /* Assigment of value for CMP1 in the TCC_STATUS register */
#define TCC_STATUS_CMP2_Pos _UINT32_(26) /* (TCC_STATUS) Compare Channel 2 Value Position */
#define TCC_STATUS_CMP2_Msk (_UINT32_(0x1) << TCC_STATUS_CMP2_Pos) /* (TCC_STATUS) Compare Channel 2 Value Mask */
#define TCC_STATUS_CMP2(value)                                                                                         \
        (TCC_STATUS_CMP2_Msk &                                                                                         \
         (_UINT32_(value) << TCC_STATUS_CMP2_Pos)) /* Assigment of value for CMP2 in the TCC_STATUS register */
#define TCC_STATUS_CMP3_Pos _UINT32_(27) /* (TCC_STATUS) Compare Channel 3 Value Position */
#define TCC_STATUS_CMP3_Msk (_UINT32_(0x1) << TCC_STATUS_CMP3_Pos) /* (TCC_STATUS) Compare Channel 3 Value Mask */
#define TCC_STATUS_CMP3(value)                                                                                         \
        (TCC_STATUS_CMP3_Msk &                                                                                         \
         (_UINT32_(value) << TCC_STATUS_CMP3_Pos)) /* Assigment of value for CMP3 in the TCC_STATUS register */
#define TCC_STATUS_Msk _UINT32_(0x0F0FFFFB) /* (TCC_STATUS) Register Mask  */

#define TCC_STATUS_FAULT_Pos _UINT32_(14) /* (TCC_STATUS Position) Non-Recoverable Fault x State */
#define TCC_STATUS_FAULT_Msk (_UINT32_(0x3) << TCC_STATUS_FAULT_Pos) /* (TCC_STATUS Mask) FAULT */
#define TCC_STATUS_FAULT(value) (TCC_STATUS_FAULT_Msk & (_UINT32_(value) << TCC_STATUS_FAULT_Pos))
#define TCC_STATUS_CCBV_Pos _UINT32_(16) /* (TCC_STATUS Position) Compare Channel x Buffer Valid */
#define TCC_STATUS_CCBV_Msk (_UINT32_(0xF) << TCC_STATUS_CCBV_Pos) /* (TCC_STATUS Mask) CCBV */
#define TCC_STATUS_CCBV(value) (TCC_STATUS_CCBV_Msk & (_UINT32_(value) << TCC_STATUS_CCBV_Pos))
#define TCC_STATUS_CMP_Pos _UINT32_(24) /* (TCC_STATUS Position) Compare Channel 3 Value */
#define TCC_STATUS_CMP_Msk (_UINT32_(0xF) << TCC_STATUS_CMP_Pos) /* (TCC_STATUS Mask) CMP */
#define TCC_STATUS_CMP(value) (TCC_STATUS_CMP_Msk & (_UINT32_(value) << TCC_STATUS_CMP_Pos))

/* -------- TCC_COUNT : (TCC Offset: 0x34) (R/W 32) Count -------- */
#define TCC_COUNT_RESETVALUE _UINT32_(0x00) /*  (TCC_COUNT) Count  Reset Value */

