ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_COUNT_COUNT_Pos _UINT32_(0) /* (TCC_COUNT) Counter Value Position */
#define TCC_COUNT_COUNT_Msk (_UINT32_(0xFFFFFF) << TCC_COUNT_COUNT_Pos) /* (TCC_COUNT) Counter Value Mask */
#define TCC_COUNT_COUNT(value)                                                                                         \
        (TCC_COUNT_COUNT_Msk &                                                                                         \
         (_UINT32_(value) << TCC_COUNT_COUNT_Pos)) /* Assigment of value for COUNT in the TCC_COUNT register */
#define TCC_COUNT_Msk _UINT32_(0x00FFFFFF) /* (TCC_COUNT) Register Mask  */

/* DITH4 mode */
#define TCC_COUNT_DITH4_COUNT_Pos _UINT32_(4) /* (TCC_COUNT) Counter Value Position */
#define TCC_COUNT_DITH4_COUNT_Msk (_UINT32_(0xFFFFF) << TCC_COUNT_DITH4_COUNT_Pos) /* (TCC_COUNT) Counter Value Mask   \
                                                                                    */
#define TCC_COUNT_DITH4_COUNT(value) (TCC_COUNT_DITH4_COUNT_Msk & (_UINT32_(value) << TCC_COUNT_DITH4_COUNT_Pos))
#define TCC_COUNT_DITH4_Msk _UINT32_(0x00FFFFF0) /* (TCC_COUNT_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_COUNT_DITH5_COUNT_Pos _UINT32_(5) /* (TCC_COUNT) Counter Value Position */
#define TCC_COUNT_DITH5_COUNT_Msk (_UINT32_(0x7FFFF) << TCC_COUNT_DITH5_COUNT_Pos) /* (TCC_COUNT) Counter Value Mask   \
                                                                                    */
#define TCC_COUNT_DITH5_COUNT(value) (TCC_COUNT_DITH5_COUNT_Msk & (_UINT32_(value) << TCC_COUNT_DITH5_COUNT_Pos))
#define TCC_COUNT_DITH5_Msk _UINT32_(0x00FFFFE0) /* (TCC_COUNT_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_COUNT_DITH6_COUNT_Pos _UINT32_(6) /* (TCC_COUNT) Counter Value Position */
#define TCC_COUNT_DITH6_COUNT_Msk (_UINT32_(0x3FFFF) << TCC_COUNT_DITH6_COUNT_Pos) /* (TCC_COUNT) Counter Value Mask   \
                                                                                    */
#define TCC_COUNT_DITH6_COUNT(value) (TCC_COUNT_DITH6_COUNT_Msk & (_UINT32_(value) << TCC_COUNT_DITH6_COUNT_Pos))
#define TCC_COUNT_DITH6_Msk _UINT32_(0x00FFFFC0) /* (TCC_COUNT_DITH6) Register Mask  */


/* -------- TCC_PATT : (TCC Offset: 0x38) (R/W 16) Pattern -------- */
#define TCC_PATT_RESETVALUE _UINT16_(0x00) /*  (TCC_PATT) Pattern  Reset Value */

#define TCC_PATT_PGE0_Pos _UINT16_(0) /* (TCC_PATT) Pattern Generator 0 Output Enable Position */
#define TCC_PATT_PGE0_Msk (_UINT16_(0x1) << TCC_PATT_PGE0_Pos) /* (TCC_PATT) Pattern Generator 0 Output Enable Mask */
#define TCC_PATT_PGE0(value)                                                                                           \
        (TCC_PATT_PGE0_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE0_Pos)) /* Assigment of value for PGE0 in the TCC_PATT register */
#define TCC_PATT_PGE1_Pos _UINT16_(1) /* (TCC_PATT) Pattern Generator 1 Output Enable Position */
#define TCC_PATT_PGE1_Msk (_UINT16_(0x1) << TCC_PATT_PGE1_Pos) /* (TCC_PATT) Pattern Generator 1 Output Enable Mask */
#define TCC_PATT_PGE1(value)                                                                                           \
        (TCC_PATT_PGE1_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE1_Pos)) /* Assigment of value for PGE1 in the TCC_PATT register */
#define TCC_PATT_PGE2_Pos _UINT16_(2) /* (TCC_PATT) Pattern Generator 2 Output Enable Position */
#define TCC_PATT_PGE2_Msk (_UINT16_(0x1) << TCC_PATT_PGE2_Pos) /* (TCC_PATT) Pattern Generator 2 Output Enable Mask */
#define TCC_PATT_PGE2(value)                                                                                           \
        (TCC_PATT_PGE2_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE2_Pos)) /* Assigment of value for PGE2 in the TCC_PATT register */
#define TCC_PATT_PGE3_Pos _UINT16_(3) /* (TCC_PATT) Pattern Generator 3 Output Enable Position */
#define TCC_PATT_PGE3_Msk (_UINT16_(0x1) << TCC_PATT_PGE3_Pos) /* (TCC_PATT) Pattern Generator 3 Output Enable Mask */
#define TCC_PATT_PGE3(value)                                                                                           \
        (TCC_PATT_PGE3_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE3_Pos)) /* Assigment of value for PGE3 in the TCC_PATT register */
#define TCC_PATT_PGE4_Pos _UINT16_(4) /* (TCC_PATT) Pattern Generator 4 Output Enable Position */
#define TCC_PATT_PGE4_Msk (_UINT16_(0x1) << TCC_PATT_PGE4_Pos) /* (TCC_PATT) Pattern Generator 4 Output Enable Mask */
#define TCC_PATT_PGE4(value)                                                                                           \
        (TCC_PATT_PGE4_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE4_Pos)) /* Assigment of value for PGE4 in the TCC_PATT register */
#define TCC_PATT_PGE5_Pos _UINT16_(5) /* (TCC_PATT) Pattern Generator 5 Output Enable Position */
#define TCC_PATT_PGE5_Msk (_UINT16_(0x1) << TCC_PATT_PGE5_Pos) /* (TCC_PATT) Pattern Generator 5 Output Enable Mask */
#define TCC_PATT_PGE5(value)                                                                                           \
        (TCC_PATT_PGE5_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE5_Pos)) /* Assigment of value for PGE5 in the TCC_PATT register */
#define TCC_PATT_PGE6_Pos _UINT16_(6) /* (TCC_PATT) Pattern Generator 6 Output Enable Position */
#define TCC_PATT_PGE6_Msk (_UINT16_(0x1) << TCC_PATT_PGE6_Pos) /* (TCC_PATT) Pattern Generator 6 Output Enable Mask */
#define TCC_PATT_PGE6(value)                                                                                           \
        (TCC_PATT_PGE6_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE6_Pos)) /* Assigment of value for PGE6 in the TCC_PATT register */
#define TCC_PATT_PGE7_Pos _UINT16_(7) /* (TCC_PATT) Pattern Generator 7 Output Enable Position */
#define TCC_PATT_PGE7_Msk (_UINT16_(0x1) << TCC_PATT_PGE7_Pos) /* (TCC_PATT) Pattern Generator 7 Output Enable Mask */
#define TCC_PATT_PGE7(value)                                                                                           \
        (TCC_PATT_PGE7_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGE7_Pos)) /* Assigment of value for PGE7 in the TCC_PATT register */
#define TCC_PATT_PGV0_Pos _UINT16_(8) /* (TCC_PATT) Pattern Generator 0 Output Value Position */
#define TCC_PATT_PGV0_Msk (_UINT16_(0x1) << TCC_PATT_PGV0_Pos) /* (TCC_PATT) Pattern Generator 0 Output Value Mask */
#define TCC_PATT_PGV0(value)                                                                                           \
        (TCC_PATT_PGV0_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV0_Pos)) /* Assigment of value for PGV0 in the TCC_PATT register */
#define TCC_PATT_PGV1_Pos _UINT16_(9) /* (TCC_PATT) Pattern Generator 1 Output Value Position */
#define TCC_PATT_PGV1_Msk (_UINT16_(0x1) << TCC_PATT_PGV1_Pos) /* (TCC_PATT) Pattern Generator 1 Output Value Mask */
#define TCC_PATT_PGV1(value)                                                                                           \
        (TCC_PATT_PGV1_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV1_Pos)) /* Assigment of value for PGV1 in the TCC_PATT register */
#define TCC_PATT_PGV2_Pos _UINT16_(10) /* (TCC_PATT) Pattern Generator 2 Output Value Position */
#define TCC_PATT_PGV2_Msk (_UINT16_(0x1) << TCC_PATT_PGV2_Pos) /* (TCC_PATT) Pattern Generator 2 Output Value Mask */
#define TCC_PATT_PGV2(value)                                                                                           \
        (TCC_PATT_PGV2_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV2_Pos)) /* Assigment of value for PGV2 in the TCC_PATT register */
#define TCC_PATT_PGV3_Pos _UINT16_(11) /* (TCC_PATT) Pattern Generator 3 Output Value Position */
#define TCC_PATT_PGV3_Msk (_UINT16_(0x1) << TCC_PATT_PGV3_Pos) /* (TCC_PATT) Pattern Generator 3 Output Value Mask */
#define TCC_PATT_PGV3(value)                                                                                           \
        (TCC_PATT_PGV3_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV3_Pos)) /* Assigment of value for PGV3 in the TCC_PATT register */
#define TCC_PATT_PGV4_Pos _UINT16_(12) /* (TCC_PATT) Pattern Generator 4 Output Value Position */
#define TCC_PATT_PGV4_Msk (_UINT16_(0x1) << TCC_PATT_PGV4_Pos) /* (TCC_PATT) Pattern Generator 4 Output Value Mask */
#define TCC_PATT_PGV4(value)                                                                                           \
        (TCC_PATT_PGV4_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV4_Pos)) /* Assigment of value for PGV4 in the TCC_PATT register */
#define TCC_PATT_PGV5_Pos _UINT16_(13) /* (TCC_PATT) Pattern Generator 5 Output Value Position */
#define TCC_PATT_PGV5_Msk (_UINT16_(0x1) << TCC_PATT_PGV5_Pos) /* (TCC_PATT) Pattern Generator 5 Output Value Mask */
#define TCC_PATT_PGV5(value)                                                                                           \
        (TCC_PATT_PGV5_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV5_Pos)) /* Assigment of value for PGV5 in the TCC_PATT register */
#define TCC_PATT_PGV6_Pos _UINT16_(14) /* (TCC_PATT) Pattern Generator 6 Output Value Position */
#define TCC_PATT_PGV6_Msk (_UINT16_(0x1) << TCC_PATT_PGV6_Pos) /* (TCC_PATT) Pattern Generator 6 Output Value Mask */
#define TCC_PATT_PGV6(value)                                                                                           \
        (TCC_PATT_PGV6_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV6_Pos)) /* Assigment of value for PGV6 in the TCC_PATT register */
#define TCC_PATT_PGV7_Pos _UINT16_(15) /* (TCC_PATT) Pattern Generator 7 Output Value Position */
#define TCC_PATT_PGV7_Msk (_UINT16_(0x1) << TCC_PATT_PGV7_Pos) /* (TCC_PATT) Pattern Generator 7 Output Value Mask */
#define TCC_PATT_PGV7(value)                                                                                           \
        (TCC_PATT_PGV7_Msk &                                                                                           \
         (_UINT16_(value) << TCC_PATT_PGV7_Pos)) /* Assigment of value for PGV7 in the TCC_PATT register */
#define TCC_PATT_Msk _UINT16_(0xFFFF) /* (TCC_PATT) Register Mask  */

#define TCC_PATT_PGE_Pos _UINT16_(0) /* (TCC_PATT Position) Pattern Generator x Output Enable */
#define TCC_PATT_PGE_Msk (_UINT16_(0xFF) << TCC_PATT_PGE_Pos) /* (TCC_PATT Mask) PGE */
#define TCC_PATT_PGE(value) (TCC_PATT_PGE_Msk & (_UINT16_(value) << TCC_PATT_PGE_Pos))
#define TCC_PATT_PGV_Pos _UINT16_(8) /* (TCC_PATT Position) Pattern Generator 7 Output Value */
#define TCC_PATT_PGV_Msk (_UINT16_(0xFF) << TCC_PATT_PGV_Pos) /* (TCC_PATT Mask) PGV */
#define TCC_PATT_PGV(value) (TCC_PATT_PGV_Msk & (_UINT16_(value) << TCC_PATT_PGV_Pos))

/* -------- TCC_WAVE : (TCC Offset: 0x3C) (R/W 32) Waveform Control -------- */
#define TCC_WAVE_RESETVALUE _UINT32_(0x00) /*  (TCC_WAVE) Waveform Control  Reset Value */

