ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/* DITH5 mode */
#define TCC_PER_DITH5_DITHERCY_Pos _UINT32_(0) /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH5_DITHERCY_Msk                                                                                     \
        (_UINT32_(0x1F) << TCC_PER_DITH5_DITHERCY_Pos) /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH5_DITHERCY(value) (TCC_PER_DITH5_DITHERCY_Msk & (_UINT32_(value) << TCC_PER_DITH5_DITHERCY_Pos))
#define TCC_PER_DITH5_PER_Pos _UINT32_(5) /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH5_PER_Msk (_UINT32_(0x7FFFF) << TCC_PER_DITH5_PER_Pos) /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH5_PER(value) (TCC_PER_DITH5_PER_Msk & (_UINT32_(value) << TCC_PER_DITH5_PER_Pos))
#define TCC_PER_DITH5_Msk _UINT32_(0x00FFFFFF) /* (TCC_PER_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_PER_DITH6_DITHERCY_Pos _UINT32_(0) /* (TCC_PER) Dithering Cycle Number Position */
#define TCC_PER_DITH6_DITHERCY_Msk                                                                                     \
        (_UINT32_(0x3F) << TCC_PER_DITH6_DITHERCY_Pos) /* (TCC_PER) Dithering Cycle Number Mask */
#define TCC_PER_DITH6_DITHERCY(value) (TCC_PER_DITH6_DITHERCY_Msk & (_UINT32_(value) << TCC_PER_DITH6_DITHERCY_Pos))
#define TCC_PER_DITH6_PER_Pos _UINT32_(6) /* (TCC_PER) Period Value Position */
#define TCC_PER_DITH6_PER_Msk (_UINT32_(0x3FFFF) << TCC_PER_DITH6_PER_Pos) /* (TCC_PER) Period Value Mask */
#define TCC_PER_DITH6_PER(value) (TCC_PER_DITH6_PER_Msk & (_UINT32_(value) << TCC_PER_DITH6_PER_Pos))
#define TCC_PER_DITH6_Msk _UINT32_(0x00FFFFFF) /* (TCC_PER_DITH6) Register Mask  */


/* -------- TCC_CC : (TCC Offset: 0x44) (R/W 32) Compare and Capture -------- */
#define TCC_CC_RESETVALUE _UINT32_(0x00) /*  (TCC_CC) Compare and Capture  Reset Value */

#define TCC_CC_CC_Pos _UINT32_(0) /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_CC_Msk (_UINT32_(0xFFFFFF) << TCC_CC_CC_Pos) /* (TCC_CC) Channel Compare/Capture Value Mask */
#define TCC_CC_CC(value)                                                                                               \
        (TCC_CC_CC_Msk & (_UINT32_(value) << TCC_CC_CC_Pos)) /* Assigment of value for CC in the TCC_CC register */
#define TCC_CC_Msk _UINT32_(0x00FFFFFF) /* (TCC_CC) Register Mask  */

/* DITH4 mode */
#define TCC_CC_DITH4_DITHERCY_Pos _UINT32_(0) /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH4_DITHERCY_Msk                                                                                      \
        (_UINT32_(0xF) << TCC_CC_DITH4_DITHERCY_Pos) /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH4_DITHERCY(value) (TCC_CC_DITH4_DITHERCY_Msk & (_UINT32_(value) << TCC_CC_DITH4_DITHERCY_Pos))
#define TCC_CC_DITH4_CC_Pos _UINT32_(4) /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH4_CC_Msk (_UINT32_(0xFFFFF) << TCC_CC_DITH4_CC_Pos) /* (TCC_CC) Channel Compare/Capture Value Mask  \
                                                                        */
#define TCC_CC_DITH4_CC(value) (TCC_CC_DITH4_CC_Msk & (_UINT32_(value) << TCC_CC_DITH4_CC_Pos))
#define TCC_CC_DITH4_Msk _UINT32_(0x00FFFFFF) /* (TCC_CC_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_CC_DITH5_DITHERCY_Pos _UINT32_(0) /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH5_DITHERCY_Msk                                                                                      \
        (_UINT32_(0x1F) << TCC_CC_DITH5_DITHERCY_Pos) /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH5_DITHERCY(value) (TCC_CC_DITH5_DITHERCY_Msk & (_UINT32_(value) << TCC_CC_DITH5_DITHERCY_Pos))
#define TCC_CC_DITH5_CC_Pos _UINT32_(5) /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH5_CC_Msk (_UINT32_(0x7FFFF) << TCC_CC_DITH5_CC_Pos) /* (TCC_CC) Channel Compare/Capture Value Mask  \
                                                                        */
#define TCC_CC_DITH5_CC(value) (TCC_CC_DITH5_CC_Msk & (_UINT32_(value) << TCC_CC_DITH5_CC_Pos))
#define TCC_CC_DITH5_Msk _UINT32_(0x00FFFFFF) /* (TCC_CC_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_CC_DITH6_DITHERCY_Pos _UINT32_(0) /* (TCC_CC) Dithering Cycle Number Position */
#define TCC_CC_DITH6_DITHERCY_Msk                                                                                      \
        (_UINT32_(0x3F) << TCC_CC_DITH6_DITHERCY_Pos) /* (TCC_CC) Dithering Cycle Number Mask */
#define TCC_CC_DITH6_DITHERCY(value) (TCC_CC_DITH6_DITHERCY_Msk & (_UINT32_(value) << TCC_CC_DITH6_DITHERCY_Pos))
#define TCC_CC_DITH6_CC_Pos _UINT32_(6) /* (TCC_CC) Channel Compare/Capture Value Position */
#define TCC_CC_DITH6_CC_Msk (_UINT32_(0x3FFFF) << TCC_CC_DITH6_CC_Pos) /* (TCC_CC) Channel Compare/Capture Value Mask  \
                                                                        */
#define TCC_CC_DITH6_CC(value) (TCC_CC_DITH6_CC_Msk & (_UINT32_(value) << TCC_CC_DITH6_CC_Pos))
#define TCC_CC_DITH6_Msk _UINT32_(0x00FFFFFF) /* (TCC_CC_DITH6) Register Mask  */


/* -------- TCC_PATTB : (TCC Offset: 0x64) (R/W 16) Pattern Buffer -------- */
#define TCC_PATTB_RESETVALUE _UINT16_(0x00) /*  (TCC_PATTB) Pattern Buffer  Reset Value */

#define TCC_PATTB_PGEB0_Pos _UINT16_(0) /* (TCC_PATTB) Pattern Generator 0 Output Enable Buffer Position */
#define TCC_PATTB_PGEB0_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB0_Pos) /* (TCC_PATTB) Pattern Generator 0 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB0(value)                                                                                         \
        (TCC_PATTB_PGEB0_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB0_Pos)) /* Assigment of value for PGEB0 in the TCC_PATTB register */
#define TCC_PATTB_PGEB1_Pos _UINT16_(1) /* (TCC_PATTB) Pattern Generator 1 Output Enable Buffer Position */
#define TCC_PATTB_PGEB1_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB1_Pos) /* (TCC_PATTB) Pattern Generator 1 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB1(value)                                                                                         \
        (TCC_PATTB_PGEB1_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB1_Pos)) /* Assigment of value for PGEB1 in the TCC_PATTB register */
#define TCC_PATTB_PGEB2_Pos _UINT16_(2) /* (TCC_PATTB) Pattern Generator 2 Output Enable Buffer Position */
#define TCC_PATTB_PGEB2_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB2_Pos) /* (TCC_PATTB) Pattern Generator 2 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB2(value)                                                                                         \
        (TCC_PATTB_PGEB2_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB2_Pos)) /* Assigment of value for PGEB2 in the TCC_PATTB register */
#define TCC_PATTB_PGEB3_Pos _UINT16_(3) /* (TCC_PATTB) Pattern Generator 3 Output Enable Buffer Position */
#define TCC_PATTB_PGEB3_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB3_Pos) /* (TCC_PATTB) Pattern Generator 3 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB3(value)                                                                                         \
        (TCC_PATTB_PGEB3_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB3_Pos)) /* Assigment of value for PGEB3 in the TCC_PATTB register */
#define TCC_PATTB_PGEB4_Pos _UINT16_(4) /* (TCC_PATTB) Pattern Generator 4 Output Enable Buffer Position */
#define TCC_PATTB_PGEB4_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB4_Pos) /* (TCC_PATTB) Pattern Generator 4 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB4(value)                                                                                         \
        (TCC_PATTB_PGEB4_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB4_Pos)) /* Assigment of value for PGEB4 in the TCC_PATTB register */
#define TCC_PATTB_PGEB5_Pos _UINT16_(5) /* (TCC_PATTB) Pattern Generator 5 Output Enable Buffer Position */
#define TCC_PATTB_PGEB5_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB5_Pos) /* (TCC_PATTB) Pattern Generator 5 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB5(value)                                                                                         \
        (TCC_PATTB_PGEB5_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB5_Pos)) /* Assigment of value for PGEB5 in the TCC_PATTB register */
#define TCC_PATTB_PGEB6_Pos _UINT16_(6) /* (TCC_PATTB) Pattern Generator 6 Output Enable Buffer Position */
#define TCC_PATTB_PGEB6_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB6_Pos) /* (TCC_PATTB) Pattern Generator 6 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB6(value)                                                                                         \
        (TCC_PATTB_PGEB6_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB6_Pos)) /* Assigment of value for PGEB6 in the TCC_PATTB register */
#define TCC_PATTB_PGEB7_Pos _UINT16_(7) /* (TCC_PATTB) Pattern Generator 7 Output Enable Buffer Position */
#define TCC_PATTB_PGEB7_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGEB7_Pos) /* (TCC_PATTB) Pattern Generator 7 Output Enable Buffer Mask */
#define TCC_PATTB_PGEB7(value)                                                                                         \
        (TCC_PATTB_PGEB7_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGEB7_Pos)) /* Assigment of value for PGEB7 in the TCC_PATTB register */
#define TCC_PATTB_PGVB0_Pos _UINT16_(8) /* (TCC_PATTB) Pattern Generator 0 Output Enable Position */
#define TCC_PATTB_PGVB0_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB0_Pos) /* (TCC_PATTB) Pattern Generator 0 Output Enable Mask */
#define TCC_PATTB_PGVB0(value)                                                                                         \
        (TCC_PATTB_PGVB0_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB0_Pos)) /* Assigment of value for PGVB0 in the TCC_PATTB register */
#define TCC_PATTB_PGVB1_Pos _UINT16_(9) /* (TCC_PATTB) Pattern Generator 1 Output Enable Position */
#define TCC_PATTB_PGVB1_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB1_Pos) /* (TCC_PATTB) Pattern Generator 1 Output Enable Mask */
#define TCC_PATTB_PGVB1(value)                                                                                         \
        (TCC_PATTB_PGVB1_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB1_Pos)) /* Assigment of value for PGVB1 in the TCC_PATTB register */
#define TCC_PATTB_PGVB2_Pos _UINT16_(10) /* (TCC_PATTB) Pattern Generator 2 Output Enable Position */
#define TCC_PATTB_PGVB2_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB2_Pos) /* (TCC_PATTB) Pattern Generator 2 Output Enable Mask */
#define TCC_PATTB_PGVB2(value)                                                                                         \
        (TCC_PATTB_PGVB2_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB2_Pos)) /* Assigment of value for PGVB2 in the TCC_PATTB register */
#define TCC_PATTB_PGVB3_Pos _UINT16_(11) /* (TCC_PATTB) Pattern Generator 3 Output Enable Position */
#define TCC_PATTB_PGVB3_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB3_Pos) /* (TCC_PATTB) Pattern Generator 3 Output Enable Mask */
#define TCC_PATTB_PGVB3(value)                                                                                         \
        (TCC_PATTB_PGVB3_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB3_Pos)) /* Assigment of value for PGVB3 in the TCC_PATTB register */
#define TCC_PATTB_PGVB4_Pos _UINT16_(12) /* (TCC_PATTB) Pattern Generator 4 Output Enable Position */
#define TCC_PATTB_PGVB4_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB4_Pos) /* (TCC_PATTB) Pattern Generator 4 Output Enable Mask */
#define TCC_PATTB_PGVB4(value)                                                                                         \
        (TCC_PATTB_PGVB4_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB4_Pos)) /* Assigment of value for PGVB4 in the TCC_PATTB register */
#define TCC_PATTB_PGVB5_Pos _UINT16_(13) /* (TCC_PATTB) Pattern Generator 5 Output Enable Position */
#define TCC_PATTB_PGVB5_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB5_Pos) /* (TCC_PATTB) Pattern Generator 5 Output Enable Mask */
#define TCC_PATTB_PGVB5(value)                                                                                         \
        (TCC_PATTB_PGVB5_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB5_Pos)) /* Assigment of value for PGVB5 in the TCC_PATTB register */
#define TCC_PATTB_PGVB6_Pos _UINT16_(14) /* (TCC_PATTB) Pattern Generator 6 Output Enable Position */
#define TCC_PATTB_PGVB6_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB6_Pos) /* (TCC_PATTB) Pattern Generator 6 Output Enable Mask */
#define TCC_PATTB_PGVB6(value)                                                                                         \
        (TCC_PATTB_PGVB6_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB6_Pos)) /* Assigment of value for PGVB6 in the TCC_PATTB register */
#define TCC_PATTB_PGVB7_Pos _UINT16_(15) /* (TCC_PATTB) Pattern Generator 7 Output Enable Position */
#define TCC_PATTB_PGVB7_Msk                                                                                            \
        (_UINT16_(0x1) << TCC_PATTB_PGVB7_Pos) /* (TCC_PATTB) Pattern Generator 7 Output Enable Mask */
#define TCC_PATTB_PGVB7(value)                                                                                         \
        (TCC_PATTB_PGVB7_Msk &                                                                                         \
         (_UINT16_(value) << TCC_PATTB_PGVB7_Pos)) /* Assigment of value for PGVB7 in the TCC_PATTB register */
#define TCC_PATTB_Msk _UINT16_(0xFFFF) /* (TCC_PATTB) Register Mask  */

