ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#define TCC_PATTB_PGEB_Pos _UINT16_(0) /* (TCC_PATTB Position) Pattern Generator x Output Enable Buffer */
#define TCC_PATTB_PGEB_Msk (_UINT16_(0xFF) << TCC_PATTB_PGEB_Pos) /* (TCC_PATTB Mask) PGEB */
#define TCC_PATTB_PGEB(value) (TCC_PATTB_PGEB_Msk & (_UINT16_(value) << TCC_PATTB_PGEB_Pos))
#define TCC_PATTB_PGVB_Pos _UINT16_(8) /* (TCC_PATTB Position) Pattern Generator 7 Output Enable */
#define TCC_PATTB_PGVB_Msk (_UINT16_(0xFF) << TCC_PATTB_PGVB_Pos) /* (TCC_PATTB Mask) PGVB */
#define TCC_PATTB_PGVB(value) (TCC_PATTB_PGVB_Msk & (_UINT16_(value) << TCC_PATTB_PGVB_Pos))

/* -------- TCC_WAVEB : (TCC Offset: 0x68) (R/W 32) Waveform Control Buffer -------- */
#define TCC_WAVEB_RESETVALUE _UINT32_(0x00) /*  (TCC_WAVEB) Waveform Control Buffer  Reset Value */

#define TCC_WAVEB_WAVEGENB_Pos _UINT32_(0) /* (TCC_WAVEB) Waveform Generation Buffer Position */
#define TCC_WAVEB_WAVEGENB_Msk                                                                                         \
        (_UINT32_(0x7) << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Waveform Generation Buffer Mask */
#define TCC_WAVEB_WAVEGENB(value)                                                                                      \
        (TCC_WAVEB_WAVEGENB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_WAVEGENB_Pos)) /* Assigment of value for WAVEGENB in the TCC_WAVEB register */
#define TCC_WAVEB_WAVEGENB_NFRQ_Val _UINT32_(0x0) /* (TCC_WAVEB) Normal frequency  */
#define TCC_WAVEB_WAVEGENB_MFRQ_Val _UINT32_(0x1) /* (TCC_WAVEB) Match frequency  */
#define TCC_WAVEB_WAVEGENB_NPWM_Val _UINT32_(0x2) /* (TCC_WAVEB) Normal PWM  */
#define TCC_WAVEB_WAVEGENB_DSCRITICAL_Val _UINT32_(0x4) /* (TCC_WAVEB) Dual-slope critical  */
#define TCC_WAVEB_WAVEGENB_DSBOTTOM_Val                                                                                \
        _UINT32_(0x5) /* (TCC_WAVEB) Dual-slope with interrupt/event condition when COUNT reaches ZERO  */
#define TCC_WAVEB_WAVEGENB_DSBOTH_Val                                                                                  \
        _UINT32_(0x6) /* (TCC_WAVEB) Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP  */
#define TCC_WAVEB_WAVEGENB_DSTOP_Val                                                                                   \
        _UINT32_(0x7) /* (TCC_WAVEB) Dual-slope with interrupt/event condition when COUNT reaches TOP  */
#define TCC_WAVEB_WAVEGENB_NFRQ                                                                                        \
        (TCC_WAVEB_WAVEGENB_NFRQ_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Normal frequency Position  */
#define TCC_WAVEB_WAVEGENB_MFRQ                                                                                        \
        (TCC_WAVEB_WAVEGENB_MFRQ_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Match frequency Position  */
#define TCC_WAVEB_WAVEGENB_NPWM                                                                                        \
        (TCC_WAVEB_WAVEGENB_NPWM_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Normal PWM Position  */
#define TCC_WAVEB_WAVEGENB_DSCRITICAL                                                                                  \
        (TCC_WAVEB_WAVEGENB_DSCRITICAL_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Dual-slope critical Position  */
#define TCC_WAVEB_WAVEGENB_DSBOTTOM                                                                                    \
        (TCC_WAVEB_WAVEGENB_DSBOTTOM_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Dual-slope with interrupt/event     \
                                                                       condition when COUNT reaches ZERO Position  */
#define TCC_WAVEB_WAVEGENB_DSBOTH                                                                                      \
        (                                                                                                              \
                TCC_WAVEB_WAVEGENB_DSBOTH_Val                                                                          \
                << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Dual-slope with interrupt/event condition when COUNT reaches \
                                              ZERO or TOP Position  */
#define TCC_WAVEB_WAVEGENB_DSTOP                                                                                       \
        (TCC_WAVEB_WAVEGENB_DSTOP_Val << TCC_WAVEB_WAVEGENB_Pos) /* (TCC_WAVEB) Dual-slope with interrupt/event        \
                                                                    condition when COUNT reaches TOP Position  */
#define TCC_WAVEB_RAMPB_Pos _UINT32_(4) /* (TCC_WAVEB) Ramp Mode Buffer Position */
#define TCC_WAVEB_RAMPB_Msk (_UINT32_(0x3) << TCC_WAVEB_RAMPB_Pos) /* (TCC_WAVEB) Ramp Mode Buffer Mask */
#define TCC_WAVEB_RAMPB(value)                                                                                         \
        (TCC_WAVEB_RAMPB_Msk &                                                                                         \
         (_UINT32_(value) << TCC_WAVEB_RAMPB_Pos)) /* Assigment of value for RAMPB in the TCC_WAVEB register */
#define TCC_WAVEB_RAMPB_RAMP1_Val _UINT32_(0x0) /* (TCC_WAVEB) RAMP1 operation  */
#define TCC_WAVEB_RAMPB_RAMP2A_Val _UINT32_(0x1) /* (TCC_WAVEB) Alternative RAMP2 operation  */
#define TCC_WAVEB_RAMPB_RAMP2_Val _UINT32_(0x2) /* (TCC_WAVEB) RAMP2 operation  */
#define TCC_WAVEB_RAMPB_RAMP1                                                                                          \
        (TCC_WAVEB_RAMPB_RAMP1_Val << TCC_WAVEB_RAMPB_Pos) /* (TCC_WAVEB) RAMP1 operation Position  */
#define TCC_WAVEB_RAMPB_RAMP2A                                                                                         \
        (TCC_WAVEB_RAMPB_RAMP2A_Val << TCC_WAVEB_RAMPB_Pos) /* (TCC_WAVEB) Alternative RAMP2 operation Position  */
#define TCC_WAVEB_RAMPB_RAMP2                                                                                          \
        (TCC_WAVEB_RAMPB_RAMP2_Val << TCC_WAVEB_RAMPB_Pos) /* (TCC_WAVEB) RAMP2 operation Position  */
#define TCC_WAVEB_CIPERENB_Pos _UINT32_(7) /* (TCC_WAVEB) Circular Period Enable Buffer Position */
#define TCC_WAVEB_CIPERENB_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_WAVEB_CIPERENB_Pos) /* (TCC_WAVEB) Circular Period Enable Buffer Mask */
#define TCC_WAVEB_CIPERENB(value)                                                                                      \
        (TCC_WAVEB_CIPERENB_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_CIPERENB_Pos)) /* Assigment of value for CIPERENB in the TCC_WAVEB register */
#define TCC_WAVEB_CICCENB0_Pos _UINT32_(8) /* (TCC_WAVEB) Circular Channel 0 Enable Buffer Position */
#define TCC_WAVEB_CICCENB0_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_WAVEB_CICCENB0_Pos) /* (TCC_WAVEB) Circular Channel 0 Enable Buffer Mask */
#define TCC_WAVEB_CICCENB0(value)                                                                                      \
        (TCC_WAVEB_CICCENB0_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_CICCENB0_Pos)) /* Assigment of value for CICCENB0 in the TCC_WAVEB register */
#define TCC_WAVEB_CICCENB1_Pos _UINT32_(9) /* (TCC_WAVEB) Circular Channel 1 Enable Buffer Position */
#define TCC_WAVEB_CICCENB1_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_WAVEB_CICCENB1_Pos) /* (TCC_WAVEB) Circular Channel 1 Enable Buffer Mask */
#define TCC_WAVEB_CICCENB1(value)                                                                                      \
        (TCC_WAVEB_CICCENB1_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_CICCENB1_Pos)) /* Assigment of value for CICCENB1 in the TCC_WAVEB register */
#define TCC_WAVEB_CICCENB2_Pos _UINT32_(10) /* (TCC_WAVEB) Circular Channel 2 Enable Buffer Position */
#define TCC_WAVEB_CICCENB2_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_WAVEB_CICCENB2_Pos) /* (TCC_WAVEB) Circular Channel 2 Enable Buffer Mask */
#define TCC_WAVEB_CICCENB2(value)                                                                                      \
        (TCC_WAVEB_CICCENB2_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_CICCENB2_Pos)) /* Assigment of value for CICCENB2 in the TCC_WAVEB register */
#define TCC_WAVEB_CICCENB3_Pos _UINT32_(11) /* (TCC_WAVEB) Circular Channel 3 Enable Buffer Position */
#define TCC_WAVEB_CICCENB3_Msk                                                                                         \
        (_UINT32_(0x1) << TCC_WAVEB_CICCENB3_Pos) /* (TCC_WAVEB) Circular Channel 3 Enable Buffer Mask */
#define TCC_WAVEB_CICCENB3(value)                                                                                      \
        (TCC_WAVEB_CICCENB3_Msk &                                                                                      \
         (_UINT32_(value) << TCC_WAVEB_CICCENB3_Pos)) /* Assigment of value for CICCENB3 in the TCC_WAVEB register */
#define TCC_WAVEB_POLB0_Pos _UINT32_(16) /* (TCC_WAVEB) Channel 0 Polarity Buffer Position */
#define TCC_WAVEB_POLB0_Msk (_UINT32_(0x1) << TCC_WAVEB_POLB0_Pos) /* (TCC_WAVEB) Channel 0 Polarity Buffer Mask */
#define TCC_WAVEB_POLB0(value)                                                                                         \
        (TCC_WAVEB_POLB0_Msk &                                                                                         \
         (_UINT32_(value) << TCC_WAVEB_POLB0_Pos)) /* Assigment of value for POLB0 in the TCC_WAVEB register */
#define TCC_WAVEB_POLB1_Pos _UINT32_(17) /* (TCC_WAVEB) Channel 1 Polarity Buffer Position */
#define TCC_WAVEB_POLB1_Msk (_UINT32_(0x1) << TCC_WAVEB_POLB1_Pos) /* (TCC_WAVEB) Channel 1 Polarity Buffer Mask */
#define TCC_WAVEB_POLB1(value)                                                                                         \
        (TCC_WAVEB_POLB1_Msk &                                                                                         \
         (_UINT32_(value) << TCC_WAVEB_POLB1_Pos)) /* Assigment of value for POLB1 in the TCC_WAVEB register */
#define TCC_WAVEB_POLB2_Pos _UINT32_(18) /* (TCC_WAVEB) Channel 2 Polarity Buffer Position */
#define TCC_WAVEB_POLB2_Msk (_UINT32_(0x1) << TCC_WAVEB_POLB2_Pos) /* (TCC_WAVEB) Channel 2 Polarity Buffer Mask */
#define TCC_WAVEB_POLB2(value)                                                                                         \
        (TCC_WAVEB_POLB2_Msk &                                                                                         \
         (_UINT32_(value) << TCC_WAVEB_POLB2_Pos)) /* Assigment of value for POLB2 in the TCC_WAVEB register */
#define TCC_WAVEB_POLB3_Pos _UINT32_(19) /* (TCC_WAVEB) Channel 3 Polarity Buffer Position */
#define TCC_WAVEB_POLB3_Msk (_UINT32_(0x1) << TCC_WAVEB_POLB3_Pos) /* (TCC_WAVEB) Channel 3 Polarity Buffer Mask */
#define TCC_WAVEB_POLB3(value)                                                                                         \
        (TCC_WAVEB_POLB3_Msk &                                                                                         \
         (_UINT32_(value) << TCC_WAVEB_POLB3_Pos)) /* Assigment of value for POLB3 in the TCC_WAVEB register */
#define TCC_WAVEB_SWAPB0_Pos _UINT32_(24) /* (TCC_WAVEB) Swap DTI Output Pair 0 Buffer Position */
#define TCC_WAVEB_SWAPB0_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_WAVEB_SWAPB0_Pos) /* (TCC_WAVEB) Swap DTI Output Pair 0 Buffer Mask */
#define TCC_WAVEB_SWAPB0(value)                                                                                        \
        (TCC_WAVEB_SWAPB0_Msk &                                                                                        \
         (_UINT32_(value) << TCC_WAVEB_SWAPB0_Pos)) /* Assigment of value for SWAPB0 in the TCC_WAVEB register */
#define TCC_WAVEB_SWAPB1_Pos _UINT32_(25) /* (TCC_WAVEB) Swap DTI Output Pair 1 Buffer Position */
#define TCC_WAVEB_SWAPB1_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_WAVEB_SWAPB1_Pos) /* (TCC_WAVEB) Swap DTI Output Pair 1 Buffer Mask */
#define TCC_WAVEB_SWAPB1(value)                                                                                        \
        (TCC_WAVEB_SWAPB1_Msk &                                                                                        \
         (_UINT32_(value) << TCC_WAVEB_SWAPB1_Pos)) /* Assigment of value for SWAPB1 in the TCC_WAVEB register */
#define TCC_WAVEB_SWAPB2_Pos _UINT32_(26) /* (TCC_WAVEB) Swap DTI Output Pair 2 Buffer Position */
#define TCC_WAVEB_SWAPB2_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_WAVEB_SWAPB2_Pos) /* (TCC_WAVEB) Swap DTI Output Pair 2 Buffer Mask */
#define TCC_WAVEB_SWAPB2(value)                                                                                        \
        (TCC_WAVEB_SWAPB2_Msk &                                                                                        \
         (_UINT32_(value) << TCC_WAVEB_SWAPB2_Pos)) /* Assigment of value for SWAPB2 in the TCC_WAVEB register */
#define TCC_WAVEB_SWAPB3_Pos _UINT32_(27) /* (TCC_WAVEB) Swap DTI Output Pair 3 Buffer Position */
#define TCC_WAVEB_SWAPB3_Msk                                                                                           \
        (_UINT32_(0x1) << TCC_WAVEB_SWAPB3_Pos) /* (TCC_WAVEB) Swap DTI Output Pair 3 Buffer Mask */
#define TCC_WAVEB_SWAPB3(value)                                                                                        \
        (TCC_WAVEB_SWAPB3_Msk &                                                                                        \
         (_UINT32_(value) << TCC_WAVEB_SWAPB3_Pos)) /* Assigment of value for SWAPB3 in the TCC_WAVEB register */
#define TCC_WAVEB_Msk _UINT32_(0x0F0F0FB7) /* (TCC_WAVEB) Register Mask  */

#define TCC_WAVEB_CICCENB_Pos _UINT32_(8) /* (TCC_WAVEB Position) Circular Channel x Enable Buffer */
#define TCC_WAVEB_CICCENB_Msk (_UINT32_(0xF) << TCC_WAVEB_CICCENB_Pos) /* (TCC_WAVEB Mask) CICCENB */
#define TCC_WAVEB_CICCENB(value) (TCC_WAVEB_CICCENB_Msk & (_UINT32_(value) << TCC_WAVEB_CICCENB_Pos))
#define TCC_WAVEB_POLB_Pos _UINT32_(16) /* (TCC_WAVEB Position) Channel x Polarity Buffer */
#define TCC_WAVEB_POLB_Msk (_UINT32_(0xF) << TCC_WAVEB_POLB_Pos) /* (TCC_WAVEB Mask) POLB */
#define TCC_WAVEB_POLB(value) (TCC_WAVEB_POLB_Msk & (_UINT32_(value) << TCC_WAVEB_POLB_Pos))
#define TCC_WAVEB_SWAPB_Pos _UINT32_(24) /* (TCC_WAVEB Position) Swap DTI Output Pair 3 Buffer */
#define TCC_WAVEB_SWAPB_Msk (_UINT32_(0xF) << TCC_WAVEB_SWAPB_Pos) /* (TCC_WAVEB Mask) SWAPB */
#define TCC_WAVEB_SWAPB(value) (TCC_WAVEB_SWAPB_Msk & (_UINT32_(value) << TCC_WAVEB_SWAPB_Pos))

/* -------- TCC_PERB : (TCC Offset: 0x6C) (R/W 32) Period Buffer -------- */
#define TCC_PERB_RESETVALUE _UINT32_(0xFFFFFFFF) /*  (TCC_PERB) Period Buffer  Reset Value */

#define TCC_PERB_PERB_Pos _UINT32_(0) /* (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_PERB_Msk (_UINT32_(0xFFFFFF) << TCC_PERB_PERB_Pos) /* (TCC_PERB) Period Buffer Value Mask */
#define TCC_PERB_PERB(value)                                                                                           \
        (TCC_PERB_PERB_Msk &                                                                                           \
         (_UINT32_(value) << TCC_PERB_PERB_Pos)) /* Assigment of value for PERB in the TCC_PERB register */
#define TCC_PERB_Msk _UINT32_(0x00FFFFFF) /* (TCC_PERB) Register Mask  */

/* DITH4 mode */
#define TCC_PERB_DITH4_DITHERCYB_Pos _UINT32_(0) /* (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH4_DITHERCYB_Msk                                                                                   \
        (_UINT32_(0xF) << TCC_PERB_DITH4_DITHERCYB_Pos) /* (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH4_DITHERCYB(value)                                                                                \
        (TCC_PERB_DITH4_DITHERCYB_Msk & (_UINT32_(value) << TCC_PERB_DITH4_DITHERCYB_Pos))
#define TCC_PERB_DITH4_PERB_Pos _UINT32_(4) /* (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH4_PERB_Msk (_UINT32_(0xFFFFF) << TCC_PERB_DITH4_PERB_Pos) /* (TCC_PERB) Period Buffer Value Mask  \
                                                                                */
#define TCC_PERB_DITH4_PERB(value) (TCC_PERB_DITH4_PERB_Msk & (_UINT32_(value) << TCC_PERB_DITH4_PERB_Pos))
#define TCC_PERB_DITH4_Msk _UINT32_(0x00FFFFFF) /* (TCC_PERB_DITH4) Register Mask  */

