ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
/* DITH5 mode */
#define TCC_PERB_DITH5_DITHERCYB_Pos _UINT32_(0) /* (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH5_DITHERCYB_Msk                                                                                   \
        (_UINT32_(0x1F) << TCC_PERB_DITH5_DITHERCYB_Pos) /* (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH5_DITHERCYB(value)                                                                                \
        (TCC_PERB_DITH5_DITHERCYB_Msk & (_UINT32_(value) << TCC_PERB_DITH5_DITHERCYB_Pos))
#define TCC_PERB_DITH5_PERB_Pos _UINT32_(5) /* (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH5_PERB_Msk (_UINT32_(0x7FFFF) << TCC_PERB_DITH5_PERB_Pos) /* (TCC_PERB) Period Buffer Value Mask  \
                                                                                */
#define TCC_PERB_DITH5_PERB(value) (TCC_PERB_DITH5_PERB_Msk & (_UINT32_(value) << TCC_PERB_DITH5_PERB_Pos))
#define TCC_PERB_DITH5_Msk _UINT32_(0x00FFFFFF) /* (TCC_PERB_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_PERB_DITH6_DITHERCYB_Pos _UINT32_(0) /* (TCC_PERB) Dithering Buffer Cycle Number Position */
#define TCC_PERB_DITH6_DITHERCYB_Msk                                                                                   \
        (_UINT32_(0x3F) << TCC_PERB_DITH6_DITHERCYB_Pos) /* (TCC_PERB) Dithering Buffer Cycle Number Mask */
#define TCC_PERB_DITH6_DITHERCYB(value)                                                                                \
        (TCC_PERB_DITH6_DITHERCYB_Msk & (_UINT32_(value) << TCC_PERB_DITH6_DITHERCYB_Pos))
#define TCC_PERB_DITH6_PERB_Pos _UINT32_(6) /* (TCC_PERB) Period Buffer Value Position */
#define TCC_PERB_DITH6_PERB_Msk (_UINT32_(0x3FFFF) << TCC_PERB_DITH6_PERB_Pos) /* (TCC_PERB) Period Buffer Value Mask  \
                                                                                */
#define TCC_PERB_DITH6_PERB(value) (TCC_PERB_DITH6_PERB_Msk & (_UINT32_(value) << TCC_PERB_DITH6_PERB_Pos))
#define TCC_PERB_DITH6_Msk _UINT32_(0x00FFFFFF) /* (TCC_PERB_DITH6) Register Mask  */


/* -------- TCC_CCB : (TCC Offset: 0x70) (R/W 32) Compare and Capture Buffer -------- */
#define TCC_CCB_RESETVALUE _UINT32_(0x00) /*  (TCC_CCB) Compare and Capture Buffer  Reset Value */

#define TCC_CCB_CCB_Pos _UINT32_(0) /* (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_CCB_Msk                                                                                                \
        (_UINT32_(0xFFFFFF) << TCC_CCB_CCB_Pos) /* (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_CCB(value)                                                                                             \
        (TCC_CCB_CCB_Msk &                                                                                             \
         (_UINT32_(value) << TCC_CCB_CCB_Pos)) /* Assigment of value for CCB in the TCC_CCB register */
#define TCC_CCB_Msk _UINT32_(0x00FFFFFF) /* (TCC_CCB) Register Mask  */

/* DITH4 mode */
#define TCC_CCB_DITH4_DITHERCYB_Pos _UINT32_(0) /* (TCC_CCB) Dithering Buffer Cycle Number Position */
#define TCC_CCB_DITH4_DITHERCYB_Msk                                                                                    \
        (_UINT32_(0xF) << TCC_CCB_DITH4_DITHERCYB_Pos) /* (TCC_CCB) Dithering Buffer Cycle Number Mask */
#define TCC_CCB_DITH4_DITHERCYB(value) (TCC_CCB_DITH4_DITHERCYB_Msk & (_UINT32_(value) << TCC_CCB_DITH4_DITHERCYB_Pos))
#define TCC_CCB_DITH4_CCB_Pos _UINT32_(4) /* (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_DITH4_CCB_Msk                                                                                          \
        (_UINT32_(0xFFFFF) << TCC_CCB_DITH4_CCB_Pos) /* (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_DITH4_CCB(value) (TCC_CCB_DITH4_CCB_Msk & (_UINT32_(value) << TCC_CCB_DITH4_CCB_Pos))
#define TCC_CCB_DITH4_Msk _UINT32_(0x00FFFFFF) /* (TCC_CCB_DITH4) Register Mask  */

/* DITH5 mode */
#define TCC_CCB_DITH5_DITHERCYB_Pos _UINT32_(0) /* (TCC_CCB) Dithering Buffer Cycle Number Position */
#define TCC_CCB_DITH5_DITHERCYB_Msk                                                                                    \
        (_UINT32_(0x1F) << TCC_CCB_DITH5_DITHERCYB_Pos) /* (TCC_CCB) Dithering Buffer Cycle Number Mask */
#define TCC_CCB_DITH5_DITHERCYB(value) (TCC_CCB_DITH5_DITHERCYB_Msk & (_UINT32_(value) << TCC_CCB_DITH5_DITHERCYB_Pos))
#define TCC_CCB_DITH5_CCB_Pos _UINT32_(5) /* (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_DITH5_CCB_Msk                                                                                          \
        (_UINT32_(0x7FFFF) << TCC_CCB_DITH5_CCB_Pos) /* (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_DITH5_CCB(value) (TCC_CCB_DITH5_CCB_Msk & (_UINT32_(value) << TCC_CCB_DITH5_CCB_Pos))
#define TCC_CCB_DITH5_Msk _UINT32_(0x00FFFFFF) /* (TCC_CCB_DITH5) Register Mask  */

/* DITH6 mode */
#define TCC_CCB_DITH6_DITHERCYB_Pos _UINT32_(0) /* (TCC_CCB) Dithering Buffer Cycle Number Position */
#define TCC_CCB_DITH6_DITHERCYB_Msk                                                                                    \
        (_UINT32_(0x3F) << TCC_CCB_DITH6_DITHERCYB_Pos) /* (TCC_CCB) Dithering Buffer Cycle Number Mask */
#define TCC_CCB_DITH6_DITHERCYB(value) (TCC_CCB_DITH6_DITHERCYB_Msk & (_UINT32_(value) << TCC_CCB_DITH6_DITHERCYB_Pos))
#define TCC_CCB_DITH6_CCB_Pos _UINT32_(6) /* (TCC_CCB) Channel Compare/Capture Buffer Value Position */
#define TCC_CCB_DITH6_CCB_Msk                                                                                          \
        (_UINT32_(0x3FFFF) << TCC_CCB_DITH6_CCB_Pos) /* (TCC_CCB) Channel Compare/Capture Buffer Value Mask */
#define TCC_CCB_DITH6_CCB(value) (TCC_CCB_DITH6_CCB_Msk & (_UINT32_(value) << TCC_CCB_DITH6_CCB_Pos))
#define TCC_CCB_DITH6_Msk _UINT32_(0x00FFFFFF) /* (TCC_CCB_DITH6) Register Mask  */


/** \brief TCC register offsets definitions */
#define TCC_CTRLA_REG_OFST _UINT32_(0x00) /* (TCC_CTRLA) Control A Offset */
#define TCC_CTRLBCLR_REG_OFST _UINT32_(0x04) /* (TCC_CTRLBCLR) Control B Clear Offset */
#define TCC_CTRLBSET_REG_OFST _UINT32_(0x05) /* (TCC_CTRLBSET) Control B Set Offset */
#define TCC_SYNCBUSY_REG_OFST _UINT32_(0x08) /* (TCC_SYNCBUSY) Synchronization Busy Offset */
#define TCC_FCTRLA_REG_OFST _UINT32_(0x0C) /* (TCC_FCTRLA) Recoverable Fault A Configuration Offset */
#define TCC_FCTRLB_REG_OFST _UINT32_(0x10) /* (TCC_FCTRLB) Recoverable Fault B Configuration Offset */
#define TCC_WEXCTRL_REG_OFST _UINT32_(0x14) /* (TCC_WEXCTRL) Waveform Extension Configuration Offset */
#define TCC_DRVCTRL_REG_OFST _UINT32_(0x18) /* (TCC_DRVCTRL) Driver Control Offset */
#define TCC_DBGCTRL_REG_OFST _UINT32_(0x1E) /* (TCC_DBGCTRL) Debug Control Offset */
#define TCC_EVCTRL_REG_OFST _UINT32_(0x20) /* (TCC_EVCTRL) Event Control Offset */
#define TCC_INTENCLR_REG_OFST _UINT32_(0x24) /* (TCC_INTENCLR) Interrupt Enable Clear Offset */
#define TCC_INTENSET_REG_OFST _UINT32_(0x28) /* (TCC_INTENSET) Interrupt Enable Set Offset */
#define TCC_INTFLAG_REG_OFST _UINT32_(0x2C) /* (TCC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define TCC_STATUS_REG_OFST _UINT32_(0x30) /* (TCC_STATUS) Status Offset */
#define TCC_COUNT_REG_OFST _UINT32_(0x34) /* (TCC_COUNT) Count Offset */
#define TCC_PATT_REG_OFST _UINT32_(0x38) /* (TCC_PATT) Pattern Offset */
#define TCC_WAVE_REG_OFST _UINT32_(0x3C) /* (TCC_WAVE) Waveform Control Offset */
#define TCC_PER_REG_OFST _UINT32_(0x40) /* (TCC_PER) Period Offset */
#define TCC_CC_REG_OFST _UINT32_(0x44) /* (TCC_CC) Compare and Capture Offset */
#define TCC_CC0_REG_OFST _UINT32_(0x44) /* (TCC_CC0) Compare and Capture Offset */
#define TCC_CC1_REG_OFST _UINT32_(0x48) /* (TCC_CC1) Compare and Capture Offset */
#define TCC_CC2_REG_OFST _UINT32_(0x4C) /* (TCC_CC2) Compare and Capture Offset */
#define TCC_CC3_REG_OFST _UINT32_(0x50) /* (TCC_CC3) Compare and Capture Offset */
#define TCC_PATTB_REG_OFST _UINT32_(0x64) /* (TCC_PATTB) Pattern Buffer Offset */
#define TCC_WAVEB_REG_OFST _UINT32_(0x68) /* (TCC_WAVEB) Waveform Control Buffer Offset */
#define TCC_PERB_REG_OFST _UINT32_(0x6C) /* (TCC_PERB) Period Buffer Offset */
#define TCC_CCB_REG_OFST _UINT32_(0x70) /* (TCC_CCB) Compare and Capture Buffer Offset */
#define TCC_CCB0_REG_OFST _UINT32_(0x70) /* (TCC_CCB0) Compare and Capture Buffer Offset */
#define TCC_CCB1_REG_OFST _UINT32_(0x74) /* (TCC_CCB1) Compare and Capture Buffer Offset */
#define TCC_CCB2_REG_OFST _UINT32_(0x78) /* (TCC_CCB2) Compare and Capture Buffer Offset */
#define TCC_CCB3_REG_OFST _UINT32_(0x7C) /* (TCC_CCB3) Compare and Capture Buffer Offset */

