ggkogkou/motor-controller-samd/src/packs/ATSAMD21_DFP/component/tcc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TCC register API structure */
typedef struct { /* Timer Counter Control */
        __IO uint32_t TCC_CTRLA; /**< Offset: 0x00 (R/W  32) Control A */
        __IO uint8_t TCC_CTRLBCLR; /**< Offset: 0x04 (R/W  8) Control B Clear */
        __IO uint8_t TCC_CTRLBSET; /**< Offset: 0x05 (R/W  8) Control B Set */
        __I uint8_t Reserved1[0x02];
        __I uint32_t TCC_SYNCBUSY; /**< Offset: 0x08 (R/   32) Synchronization Busy */
        __IO uint32_t TCC_FCTRLA; /**< Offset: 0x0C (R/W  32) Recoverable Fault A Configuration */
        __IO uint32_t TCC_FCTRLB; /**< Offset: 0x10 (R/W  32) Recoverable Fault B Configuration */
        __IO uint32_t TCC_WEXCTRL; /**< Offset: 0x14 (R/W  32) Waveform Extension Configuration */
        __IO uint32_t TCC_DRVCTRL; /**< Offset: 0x18 (R/W  32) Driver Control */
        __I uint8_t Reserved2[0x02];
        __IO uint8_t TCC_DBGCTRL; /**< Offset: 0x1E (R/W  8) Debug Control */
        __I uint8_t Reserved3[0x01];
        __IO uint32_t TCC_EVCTRL; /**< Offset: 0x20 (R/W  32) Event Control */
        __IO uint32_t TCC_INTENCLR; /**< Offset: 0x24 (R/W  32) Interrupt Enable Clear */
        __IO uint32_t TCC_INTENSET; /**< Offset: 0x28 (R/W  32) Interrupt Enable Set */
        __IO uint32_t TCC_INTFLAG; /**< Offset: 0x2C (R/W  32) Interrupt Flag Status and Clear */
        __IO uint32_t TCC_STATUS; /**< Offset: 0x30 (R/W  32) Status */
        __IO uint32_t TCC_COUNT; /**< Offset: 0x34 (R/W  32) Count */
        __IO uint16_t TCC_PATT; /**< Offset: 0x38 (R/W  16) Pattern */
        __I uint8_t Reserved4[0x02];
        __IO uint32_t TCC_WAVE; /**< Offset: 0x3C (R/W  32) Waveform Control */
        __IO uint32_t TCC_PER; /**< Offset: 0x40 (R/W  32) Period */
        __IO uint32_t TCC_CC[4]; /**< Offset: 0x44 (R/W  32) Compare and Capture */
        __I uint8_t Reserved5[0x10];
        __IO uint16_t TCC_PATTB; /**< Offset: 0x64 (R/W  16) Pattern Buffer */
        __I uint8_t Reserved6[0x02];
        __IO uint32_t TCC_WAVEB; /**< Offset: 0x68 (R/W  32) Waveform Control Buffer */
        __IO uint32_t TCC_PERB; /**< Offset: 0x6C (R/W  32) Period Buffer */
        __IO uint32_t TCC_CCB[4]; /**< Offset: 0x70 (R/W  32) Compare and Capture Buffer */
} tcc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD21_TCC_COMPONENT_H_ */
